[
{
    "model": "celestial_forge.domain",
    "pk": 1,
    "fields": {
        "name": "Toolkits",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 2,
    "fields": {
        "name": "Knowledge",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 3,
    "fields": {
        "name": "Vehicles",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 4,
    "fields": {
        "name": "Production Speed",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 5,
    "fields": {
        "name": "Crafting Skills",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 6,
    "fields": {
        "name": "Clothing",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 7,
    "fields": {
        "name": "Magic",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 8,
    "fields": {
        "name": "Quality",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 9,
    "fields": {
        "name": "Transformative",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 10,
    "fields": {
        "name": "Resources",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 11,
    "fields": {
        "name": "Magitech",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 12,
    "fields": {
        "name": "Alchemy",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 13,
    "fields": {
        "name": "Toolkits",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 14,
    "fields": {
        "name": "Knowledge",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 15,
    "fields": {
        "name": "Vehicles",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 16,
    "fields": {
        "name": "Production Speed",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 17,
    "fields": {
        "name": "Crafting Skills",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 18,
    "fields": {
        "name": "Clothing",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 19,
    "fields": {
        "name": "Magic",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 20,
    "fields": {
        "name": "Quality",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 21,
    "fields": {
        "name": "Transformative",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 22,
    "fields": {
        "name": "Resources",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 23,
    "fields": {
        "name": "Magitech",
        "description": ""
    }
},
{
    "model": "celestial_forge.domain",
    "pk": 24,
    "fields": {
        "name": "Alchemy",
        "description": ""
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 1,
    "fields": {
        "name": "Workshop",
        "description": "A small workshop for Mechanics that is geared largely towards building small machines, medium machines...and well, massive machines as well. You’ll have to adjust the tools accordingly yourself for different machines, but the workshop will scale to fit what machines you put into it. Will slowly repair any machines placed inside.",
        "cost": 0,
        "source": "Dark Cloud 2",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 2,
    "fields": {
        "name": "Omnitool",
        "description": "Comes with a free set of basic armor with a kinetic barrier, a basic weapon, one for each type you are proficient in and a decent Omni-Tool holographic wrist-computer capable of fabricating things with Omni-Gel, like a blade.",
        "cost": 0,
        "source": "Mass Effect",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 3,
    "fields": {
        "name": "Hangar",
        "description": "Planes are fine when they’re going through the air and dealing with enemies. But leaving them to the elements and the outdoors when they’re not in use? Well that just seems really crass. You need somewhere to store your vehicles and planes when you’re not busy destroying anything that’s not on your side, and that’s what these establishments are for. It’s not the most fancy thing in the world, but it’ll serve its purpose and make sure your means for vehicular slaughter are in prime condition for their tasks. For an additional +50BP, these hangar bays also come equipped with special clamps and harnesses to make refitting and refueling any planes ,go much more quickly than they would if you were using them by hand. For sea-based bases, this also means you have docks for boats and submarines.",
        "cost": 0,
        "source": "Ace Combat",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 4,
    "fields": {
        "name": "Workshop",
        "description": "You have a basic workshop.",
        "cost": 0,
        "source": "Warehouse",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 5,
    "fields": {
        "name": "Alchemical Foundry",
        "description": "You gain the equipment needed to extract, process, and refine Titaniumand Glassteel. It exacts about one ingot a week.",
        "cost": 50,
        "source": "Endless Legend",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 6,
    "fields": {
        "name": "Diagnostic Tools",
        "description": "A small data display with numerous connectors and scanners, capable of letting you know what is wrong with simple technology and what advanced technology that has been programmed into it.",
        "cost": 50,
        "source": "Outlaw Star",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 7,
    "fields": {
        "name": "Micromanipulators",
        "description": "These delicate gloves were meant for scientific purposes. They're reinforced with small motors and electrically contracting artificial muscles to allow you to perform delicate work on the scale of a micron. While they're definitely more suited to scientific experiments, they can be put to use in any situation that requires steady hands like aiming a rifle, conducting brain surgery, cooking, defusing a bomb, or even bypassing some redirection and shielding abilities.",
        "cost": 50,
        "source": "Raildex Science",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 8,
    "fields": {
        "name": "Alchemy Machines",
        "description": "These machines will be the basis for your use of Alchemy, with which you can create and combine a multitude of useful items throughout your time here, and perhaps beyond that... as long as you have Grist to pay for what you want to Make. Since these are necessary to even start your game, they're even free... beyond the cost in Grist to construct them of course. But if you want to spend some of your CP here, you can start with a fully upgraded variant, gaining every upgrade made to this equipment during the story of Homestuck immediately, without the cost of grist going up at all or having to spend time fiddling around to get them.",
        "cost": 100,
        "source": "SBURB",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 9,
    "fields": {
        "name": "The Mixing Cauldron",
        "description": "Every Alchemists’ trusty tool, the mixing cauldron is basically the alchemist’s work desk and research station combined into one. With this, no potion is out of reach –though it isn’t uncommon to find that some alchemists’ will create...other things from their cauldrons, and one would be foolish to presume that a cauldron can’t be improved...",
        "cost": 100,
        "source": "Atelier: Arland Trilogy",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 10,
    "fields": {
        "name": "Alchemy Workshop",
        "description": "Build into a wagon, this full-scale workshop allows for scientific research in the field, and provides all the tools the aspiring researcher needs to learn about the world they are in. Just don't blow yourself up or blind anyone, ok?",
        "cost": 100,
        "source": "Endless Legend",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 11,
    "fields": {
        "name": "Laboratorium",
        "description": "Ancient cogitators, arrays of auspex systems, and volume upon volume of documentation supply an Adept with the tools and information necessary to capably analyze a recovered technological artefact.",
        "cost": 100,
        "source": "Light of Terra",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 12,
    "fields": {
        "name": "Workshop",
        "description": "You need tools? You have ALL the tools. Using this, you can effectively build and/or repair any damn thing in BGC, though constructing orbital shuttles might take a while. Never mind getting ahold of the plans. Can act as an independent location or as an upgrade/attachment to Canyon Garage or Underground Hideout.",
        "cost": 100,
        "source": "Bubblegum Crisis",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 13,
    "fields": {
        "name": "Armor-Shift Manufacture",
        "description": "A small machine - big enough to hold a massive pauldron or two - that gives any pieces of armor or clothing placed inside a specific quality: When their wearer changes form, the armor and clothing changes form with them.",
        "cost": 100,
        "source": "Bloody Roar",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 14,
    "fields": {
        "name": "The Toolkit",
        "description": "When wielding this toolkit, you can repair devices most would think broken beyond salvation. You could find two twisted armor plates and a couple of treads and before you know it, you have a tank that's as good as new.",
        "cost": 100,
        "source": "Sabaton",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 15,
    "fields": {
        "name": "Kinesis Amplifier",
        "description": "Your kinesis module's artificial gravity field has a range of about five meters of grabbing and, while that's not likely to change without your own tinkering, you can use points to increase the initial power of a throw, increasing the effective range of your throws by 15% and and the damage of the throw by 10%, making it much easier to pin enemies to walls.",
        "cost": 100,
        "source": "Dead Space",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 16,
    "fields": {
        "name": "Striker Artificer Toolkit",
        "description": "All the tools you need to make a Striker.",
        "cost": 100,
        "source": "Strike Witches",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 17,
    "fields": {
        "name": "Tool Kit",
        "description": "Woah now, Sonny Jim! You don't expect to fix that machine with your bare fingers, do you? Don't go anywhere without the equipment you need to make sure that tech keeps on trucking! A handy dandy set of tools to accommodate for maintaining Variable Fighters. This will make things easier if you want to keep things in shape or just want to poke around and see what's inside!",
        "cost": 100,
        "source": "Macross",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 18,
    "fields": {
        "name": "Garage",
        "description": "You have a nice garage and parts supply. With a few days and some elbow grease, you could basically rebuild your car or cars from the bottom up; you probably have enough parts to keep someone else's ride running or give it an upgrade, too.",
        "cost": 100,
        "source": "Fast and Furious",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 19,
    "fields": {
        "name": "Alchemy Machine",
        "description": "A personal Variation of the machine you'll come to see all over cradle. This one allows for a degree of experimentation that none of the other machines will, and is capable of accepting a great variety of materials without taking any damage. You'll be able to tweak existing recipes, or even come up with new ones altogether with enough time. Who knows, you might stumble on something good.",
        "cost": 200,
        "source": "Spiral Knights",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 20,
    "fields": {
        "name": "Workshop/3D Fabricator",
        "description": "Powered tools for cyborg disassembly and repair. Bulky diagnostic computer, ten kilograms of miscellaneous spare parts, very rare compact 3D fabricator capable of milling custom components and printing or repairing circuitry. Free Rocket Hammer.",
        "cost": 200,
        "source": "GUNNM",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 21,
    "fields": {
        "name": "Soul of the Forge",
        "description": "There is no \"soul of the forge,\" there isn't even a forge so lets just say this gives you a portable forge. *Suggested* You can summon a workshop with forge wherever you are to do work. This takes a few minutes of your time to either summon or dismiss and can’t be summoned in such a way that it will harm someone directly. Using the tools inside afterwards to do such is fine. Anything made in this forge is of higher quality then normal and anyone who examines it knows that it was created by someone who loves their craft. This forge will not provide raw materials to work with, but you can store any materials or supplies inside it well summoned, that will stick around though summoning until you use them or remove them. You can not use this to store anything living.",
        "cost": 200,
        "source": "World of Warcraft",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 22,
    "fields": {
        "name": "Hidden Hideaway/Laboratory",
        "description": "You've come into possession of a small but out of the way safe-house, providing you with a place to rest and recuperate. This place has enough supplies for 9 people to live for a year or so. Those who have chosen the Scientist origin however, gain an upgrade to this building in the form of an underground laboratory. It is stocked with all the necessary tools and ingredients for a secret lab in the 1930's, along with a few scattered notes on what appears to be a figure surrounded in light.",
        "cost": 200,
        "source": "Valkyria Chronicles",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 23,
    "fields": {
        "name": "Workshop",
        "description": "A small base filled with all the equipment you’ll need to work. This lab can be used for your choice of scientific or magical research.",
        "cost": 200,
        "source": "Samurai Jack",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 24,
    "fields": {
        "name": "Skyforge",
        "description": "An ancient, mysterious, eagle themed forge added to your warehouse. Any metal items crafted at the forge will be significantly harder and stronger for it. Something about the fires.",
        "cost": 200,
        "source": "The Elder Scrolls: Skyrim",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 25,
    "fields": {
        "name": "Ars Creation Tools",
        "description": "Tools required to make Ars Magus and Ars Armagus. Without these, creating such things would be impossible, because creating the converter to let the user manipulate Seithr requires these specialized tools for the process to work properly.",
        "cost": 200,
        "source": "Blazblue",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 26,
    "fields": {
        "name": "Scanner",
        "description": "Serves a number of purposes. Primarily, allows you to determine the location of all living creatures within a large radius around the user, although this might be blocked by certain defenses or stealth abilities. Also capable of determining molecular structure and provides blueprints when scanning objects.",
        "cost": 200,
        "source": "Iji",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 27,
    "fields": {
        "name": "Workshop Equipment",
        "description": "This is actually a package deal containing a variety of workshop tools. The first tool set has some basic tools for repairing equipment and some more specialized tools for upgrading weaponry with varying Blood Stones. The second set of tools allows for the slotting and removal of Blood Gems, items that as previously mentioned can greatly empower weaponry. The last set of tools allows you to etch Caryll Runes into the mind to attain their wondrous strength, or remove them just as easily. Runesmith Caryll, student of Byrgenwerth, transcribed the inhuman utterings of the Great Ones into what are now called Caryll Runes. Etching these runes into your mind can provide a number of benefits. Benefits can range from resisting certain types of damage, increasing resistance to various poisons or increasing stamina and vitality, among other effects. You may etch up to three runes into your mind at a time. These runes can be found scattered around this world.",
        "cost": 300,
        "source": "Bloodborne",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 28,
    "fields": {
        "name": "Advanced Materials Upgrade Kit",
        "description": "Plasteel, adamantium, armourplas, synth-leather and other sophisticated materials are used for all sorts of purposes within the Imperium and are typically far more resilient than their archaic equivalents. Archaic styles of armor are seldom effective against advanced weapons, and rarely used in any case, but many of those who hail from primitive cultures favor the styles of wargear they are accustomed to. Wrought from plasteel and armourplas instead of bronze, iron and steel, a suit of chain or plate can be a quite effective defense, often the equal of more modern armors.",
        "cost": 300,
        "source": "Light of Terra",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 29,
    "fields": {
        "name": "Mythical Forge",
        "description": "You have obtained a forge capable of creating gems, as well as upgrading any of your weapons to their fullest potential. The staff known as Golden Star can become Tien’s Justice, the sword known as Fortune’s Favorite can become the Demon Sword. Furthermore, this forge can upgrade your own weapons, increasing the skill it takes to use them, but enhancing their abilities by 50% ... provided you are willing to think of a cool name and backstory for them. The forge is a stickler for tradition.",
        "cost": 300,
        "source": "Jade Empire",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 30,
    "fields": {
        "name": "Volcanic Forge",
        "description": "The Smith God's power is great, but it is not by his will alone that his works are forged. There is also his tools to consider, and with this you have one such tool. Attached to your Warehouse is a small volcano, a fiery beast that will never fade and never falter. Its power is great, reducing the time you need to break down metals and minerals, reworking them into new forms while increasing their quality and inherent strengths. Should you choose, you may also take a significant hit in forging time to experiment with different metals and minerals, melting and combining them to create a different, newer resource with one quality from the second object in question. Rise, craftsman. Rise and begin your work.",
        "cost": 300,
        "source": "God of War",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 31,
    "fields": {
        "name": "Prismatic Laboratory",
        "description": "The principle of acute observation is light! And to that end, you have fashioned a workspace of lenses, liquids, critters and crystals to focus upon recreating a spectrum of lights fantastic. Ah, the impossible palette: those colors only seen in the Neath! You may not always produce something like it, but you will produce their inks and lenses in time.",
        "cost": 400,
        "source": "Fallen London",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 32,
    "fields": {
        "name": "The Alchemy Machine",
        "description": "Created by the legendary alchemist Louis Garcon, this mysterious machine combines modern science with principles passed down from ancient Egyptian times. Should you have any alchemic ability or knowledge, using this machine will not only drastically enhance the potency of anything you create, but also significantly boost the output. Careful experimentation may even let you learn to automate the alchemic process, allowing the machine to produce indefinitely if provided with supplies. Without such knowledge, though, expect significantly more experimentation before you achieve anything of note.",
        "cost": 400,
        "source": "Shivers",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 33,
    "fields": {
        "name": "Launderer System",
        "description": "You gain a new thing to place in your warehouse, and though you don’t exactly know how it works the instruction booklet says it can construct beam katanas of all different styles and usefulness if given the right components-or if you don’t have those, shoving the right raw ingredients in enough quantity to just manufacture the damn things. With enough technical knowledge, you will be able to discard the manual. [beam katana's are kind of like light sabers only with a stabaliser thing that runs the length of the beam and has something at the top, kind of like the \"]\" bracket.]",
        "cost": 400,
        "source": "No More Heroes",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 34,
    "fields": {
        "name": "Lathe-Wrought Armour Plating Kit",
        "description": "The astronomical and gravitational alignment of the Lathe worlds creates the conditions for the production of metal alloys of rare and singular properties. Lathe armour plating is strong and light, flexible enough to withstand the most powerful blows, and even resistant to intense heat or the crackling edge of a power weapon. The cost and rarity of such an upgrade is beyond the means of most individuals, with maybe only half a dozen sets of Lathe-wrought armour upgrade kits constructed in a decade, each created under commission for a specific wearer.",
        "cost": 400,
        "source": "Light of Terra",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 35,
    "fields": {
        "name": "Crucible of Eight Trigrams",
        "description": "A big ass crucible that can render down *most* objects into their base components. Magic and enchantments can be removed this way and used for later experiments, although this will take some time to accomplish and is not an exact science. You can’t use it to break down living creatures.",
        "cost": 500,
        "source": "Journey to the West",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 36,
    "fields": {
        "name": "Orgel of Origins",
        "description": "A copy of the original Song Science device. A handheld music box that plays a very carefully calibrated song. It is made of Parameno and Grathnode -and got hot pretty quickly. Enjoy your white hole generator -this is what powers the entire tower, including the antigravity generators, weather control, and giant beam cannons. All of it. It’s an infinite energy generator, with a very high output. Unless you buy both this and Song Science, replicating it is nearly impossible, with both it is tricky.",
        "cost": 500,
        "source": "Ar Tonelico",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 37,
    "fields": {
        "name": "AGE System",
        "description": "This is a 3-part package deal, so you’re getting more bang for your buck. First is the AGE Device, which is a massive data-storage unit that contains the Asuno’s research data (though for you it starts only with what Flit managed to create and gather before the series start) and the blueprints for the Gundam’s armor. It also acts as a key-none of the other parts of this system will operate without it. Next is the AGE Builder, which is an extremely fast 3-D printer (able to make a Mobile Suit rifle in seconds) and continuously collects data from the AGE Device and AGE System. The AGE System is a data collection program that can be installed onto a Mobile Suit and acts as a unique OS. It will collect data and evolve along with its pilot, researching ‘solutions’ to problems, coming in the form of the Wear Parts, arm and legs designed to improve and counter situations. The Wear Parts are flown to the AGE Gundams in battle using the AMEMBO (one of which is included with this purchase) and swapped mid-battle, though with a different design you could remove the AMEMBO from the equation entirely. This is a highly advanced system, one that can collect, analyze, improve, build and conquer many situations. A Mobile Suit equipped with the AGE System will have a bright letter on its front, defaulting to a blue ‘A’-as a bonus, you may change the coloring and the letter to whatever you wish at any time.",
        "cost": 600,
        "source": "Gundam AGE",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 38,
    "fields": {
        "name": "Architect's Eye",
        "description": "Every structure has a purpose, a reason for being. When it comes to buildings you know exactly what to do and how to do it. This makes building stable, good looking, and comfortable buildings. This also extends to being able to know the who, what, when, where, and why of any non-weaponized structure. This expands the more you learn about other cultures, places, science, and technology. Eventually learn to build things to withstand black holes or places with non-euclidian geometry etc and not compromise your end goal [allowing something to survive in it]. This also lets you spot weak points, flaws, and exploits in design as well.",
        "cost": 600,
        "source": "LOSS",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 39,
    "fields": {
        "name": "Orb Design Plans",
        "description": "Well... this is curious. The design plans for a Micro-Brain Repair Unit... this won't show up for some time, but it is quite useful nonetheless. Once assembled, it will have the ability to scan and repair any damaged machinery it comes across, simply by using the materials around it. The more advanced the machine is, the longer it will take... but it will do its job. Even more concerningly, it has the ability to learn and adapt itself, assimilating machinery to create a more grand body. It may come with existential issues... are you sure you want this?",
        "cost": 800,
        "source": "Swat Kats",
        "domain": 1,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 40,
    "fields": {
        "name": "Hands of Icarus",
        "description": "You have an understanding of how to use the advanced technology of Synapse. While you're not sure of the 'how' or 'why' the device operates, you can operate any Synapse-made machinery with ease. Past this jump, you know how to use (though not how to make) any basic technological devices (point-and-click devices, guns, switches, etc.) you would otherwise require training or re-education for, no matter how alien or new it is to you.",
        "cost": 100,
        "source": "Heaven's Lost Property",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 41,
    "fields": {
        "name": "Engineering",
        "description": "You're a master mechanic and an expert at building robots and other technological devices. You also have a fair bit of knowledge about hacking into computers.",
        "cost": 100,
        "source": "Teen Titans",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 42,
    "fields": {
        "name": "Etoria Disciple",
        "description": "The art of Etoria, the technology which allowed for the creation of things like airships, has always fascinated you. You've noticed patterns in technology, and armed with that knowledge you adapt to new technology quickly. Your teacher has given you a skystone -the key to building your own airship in time, and you'll have no lack of resources.",
        "cost": 100,
        "source": "Final Fantasy XII",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 43,
    "fields": {
        "name": "Engineering Basics",
        "description": "You're a real Mr. Fix-It, y'know? Malfunctioning fuel intake? Easy. Faulty asteroid defense cannon? Turn it off, then on again. Non-responsive communications array? Shuffle the working emitters around a bit so they're symmetrical. Undead monstrosities? Depends on what you mean by, \"fix.\" Does using a rivet gun to blow them apart count? Yes? Then we're good.",
        "cost": 100,
        "source": "Dead Space",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 44,
    "fields": {
        "name": "Build That Wall",
        "description": "You know the basics of Caelondian technology. You understand how to harness the semi­mystical power of Cores and turn it into usable Mantic energy, to power basic machinery, short­range flying machines, computers, and a variety of other uses. More interestingly, you can use Core power to reinforce existing structures, running a Matic current through it to enhance whatever physical properties it possesses ­ usually durability, though other uses are possible. This is what allowed structures like the Rippling Wall and the Bastion to survive the Calamity as well as they did. You also gain basic skill for mundane construction.",
        "cost": 100,
        "source": "Bastion",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 45,
    "fields": {
        "name": "Ancient Knowledge",
        "description": "You know how to operate the devices left behind by the ancient solar empires – if you can find them.",
        "cost": 100,
        "source": "Mysterious Cities of Gold",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 46,
    "fields": {
        "name": "Analysis",
        "description": "You can immediately identify any defects in hardware upon casual observation. This is effective on devices, Vehicles, and buildings.",
        "cost": 100,
        "source": "Red Alert 3",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 47,
    "fields": {
        "name": "Technician",
        "description": "The tech knights of the spiral order are experienced mechanics, but are often not as experienced in weapon usage. Only a few, known as Technicians, have quick thinking and bravery necessary to utilize their skills in combat situations. You are a prime example of this truth, having learnt to use your skills out in the field within the fires of combat. your skills range from making quick repairs to creating, maintaining, and even rapidly dismantling complex mechanical constructs, even something as complicated as a battlepod. Needless to say, your skill in disabling locks, deploying turrets for some much-needed suppressive firepower, repairing the armor of your squad mates, and the like are greatly appreciated by your squad mates and essential to survival within a world of machines.",
        "cost": 200,
        "source": "Spiral Knights",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 48,
    "fields": {
        "name": "What's This Do?",
        "description": "The technology used in the frontier can be so complex and advanced it takes years for even the most brilliant minds to understand. Really now? That's good, you needed something to do after lunch today. Now, even if your in a dropship in the middle of a fire fight, you can decipher the inner workings of technology so long as you have the controls to scre- I mean analyze.",
        "cost": 200,
        "source": "Titanfall",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 49,
    "fields": {
        "name": "Holy Forge",
        "description": "You know how to craft the Holy Power Armor of the Templars, Each suit of armor is customized for the user. All suits increase strength and speed, however Common personal suit augmentations include Anchor spikes (that form from hands or feet), Hammer Fist (lock your gauntlets into a hammer), camouflage screening, and 360 HUD in the helmet.",
        "cost": 200,
        "source": "Hellgate London",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 50,
    "fields": {
        "name": "Xenospecialist",
        "description": "The problem with fighting and violence is that it's no place for an egghead, and as a result valuable information could be lost to a wayward grenade before study. You've taken it upon yourself to bring that knowledge back, and as such you have an easier time understanding alien language and technology. It won't give you instant knowledge, but as you study further you will find it becomes easier to comprehend.",
        "cost": 200,
        "source": "Gears of War",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 51,
    "fields": {
        "name": "Technomage",
        "description": "Strike Witches generally rely on service crews to tune and repair their striker, but not you. You'll be able to do the job much better and be able to modify your Striker to aid you focus your speed, defense or attack if you have offensive magical abilities. If you have technology from other jumps, you'll be able to incorporate them into your striker and with enough time make one from scratch.",
        "cost": 200,
        "source": "Strike Witches",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 52,
    "fields": {
        "name": "Engineer",
        "description": "Yet by understanding the nature of computer systems, wouldn’t it be prudent to understand the technology those systems command? After all, what if you found yourself needing to recalibrate a Magnetic Accelerator Cannon or repair one of the dangerous Shaw-Fujikawa Translight Engines that makes faster-than-light travel possible? What if you found a cache of human weaponry that could be used if someone managed to repair it? While you don’t have the skill to create something as complex as a Shaw-Fujikawa Translight Engine, you’ll know your way around it just like much of Humanity’s26thcentury technology. You might even figure out how to make small improvements to the technology if you had the time to sit down and look it over. Hopefully the Covenant give you that time.",
        "cost": 200,
        "source": "Halo",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 53,
    "fields": {
        "name": "Machines, They Just Speak To Me",
        "description": "You have no formal schooling, but can fine-tune and repair engines with nothing but shoe polish. You don’t know what the parts are SUPPOSED to do, but you know how to make them work the way you want. You can diagnose a faulty part in the power core just by listening to the AC cycle, and can fix pretty much anything with naught but a wrench and some duct tape. It may not be pretty, and it may not last long, but it’ll work.",
        "cost": 200,
        "source": "Firefly",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 54,
    "fields": {
        "name": "Machinist",
        "description": "Like the famous air pirate Centime, you know your way around machinery. You can repair or build almost anything, given time and resources.",
        "cost": 200,
        "source": "Skies of Arcadia",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 55,
    "fields": {
        "name": "Valkyrian Science",
        "description": "Somehow, you've gained some of the knowledge that the Valkyrur used to possess, giving you the skill and ability to graft Ragnite machinery on a level far above any modern human. At first, you'd only be able to create replica's of the Valkyrian weapons, but with many years of study it might be possible to recreate the Valkyrur themselves.",
        "cost": 300,
        "source": "Valkyria Chronicles",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 56,
    "fields": {
        "name": "Grease Monkey",
        "description": "What can you fix or build? What CAN'T you fix or build? Nothing, that's what. From hyper-cars to Buma, computers to Hardsuits, with the right tools and enough time and experiments, you can build it all, weaponry included.",
        "cost": 300,
        "source": "Bubblegum Crisis",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 57,
    "fields": {
        "name": "The Divine Machines",
        "description": "Many and varied are the wonders of the Gods. From the Vasty Hall of Death, Yama brings forth Thunder Chariot and Bright Spear, Trident of Destruction and Wand of Universal Fire. In Heaven, there is an elegant statue with eight arms that plays the lute when addressed, and endless machines that keep all in perfect stasis. The elementary forms of these great sciences and artefacts are laid bare to you, and you may service and understand the technology of this world. While great innovations and the wonders forged by Yama might escape you, you have a solid basis that escapes the vast majority of men and gods in the world -sufficient to greatly impress those who understand the value of such things. With this you also gain one artefact costing 200CP or less for free. [Free Artifact] Opulent Warehouse - Do the bare walls and drab concrete styling of your cosmic warehouse offend thine eyes? Did you wish for a shaded bower, gilded conservatory or tawdry bordello? While the total size and features will not be changed, the cosmetic structure and layout is yours to realign –as long as it is opulent. Change your bare metal shelving into a dozen cozy rooms, filled with leather-bound books and the smell of rich mahogany. Make your Portal appear edged with basalt andgold, and Forcefield into an invincible iron gate that parts only for you. Once set, you may change the appearance once per Jump.",
        "cost": 300,
        "source": "Lord of Light",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 58,
    "fields": {
        "name": "Gadgeteering",
        "description": "Ars Magus aren't the solution to every problem, and more often than not end up causing more than they solve. You have training in \"Traditional\" science, and can create purely mechanical devices and weapons, such as magnetism-powered gauntlets.",
        "cost": 300,
        "source": "Blazblue",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 59,
    "fields": {
        "name": "Not A Stupid Grunt",
        "description": "Technology has always been your forte. You can hack into some poor shmuck's omni-tool or fix a Tantalus drive core. All you need to start making Mass Relay Jumps is a toaster and a chunk of Eezo.",
        "cost": 300,
        "source": "Mass Effect",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 60,
    "fields": {
        "name": "Analysis",
        "description": "You have the skill and insight to make powerful analytical tools. Such tools are capable of showing you the physical makeup of the things you come across, detect magic and alert you to hidden doorways.",
        "cost": 300,
        "source": "Adventure Time",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 61,
    "fields": {
        "name": "Fitting into a Mould: Scientist",
        "description": "In a world where “magic” is essentially limited to a few, science is the only tool that can be used as an equalizer. So your job here in researching and developing new technology may be essentially what’s needed in order to keep humanity going. Well, that’s the motivation that sounds noble anyways. In practice, much of what you’re going to do here might be of more use to you than the common folk in Hekseville. For one thing you’ll be very well versed in Nevi adaptation technology by the end of your time here, as well as constructing technology necessary for the control and manipulation of gravity. Can’t say that won’t come in handy...considering both the Nevi and the Shifters are quite possibly the biggest threats to the city in the eyes of some.",
        "cost": 400,
        "source": "Gravity Rush",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 62,
    "fields": {
        "name": "Xenotechnology",
        "description": "You have a very technical mind and you've been able to apply your theoretical degree in physics to good use. You're able to incorporate artifacts and pieces of artifacts into any technological devices you may know how to build with a lot less spontaneous death and irradiation than you normally would. This allows you to build things like featherlight power armor, accelerated gauss rifles and other technological marvels.",
        "cost": 400,
        "source": "STALKER",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 63,
    "fields": {
        "name": "Orokin Tech",
        "description": "Few have ever reached the innovation and technological prowess of the Orokin Empire... their gold and ivory exteriors hiding minds as sharp as steel. Likewise, the golden trim of their technology hid an advancement that continues to elude the majority of the System to this day. It eludes you no longer, the secrets of Orokin technology present in your mind. You'll be capable of augmenting technology significantly, increasing its capabilities at the same time and granting a durability that will last millennia. Perhaps in time, the secrets of the Warframe creation process will be yours to covet and yours alone, basked in the light of science and superior intellect.",
        "cost": 400,
        "source": "Warframe",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 64,
    "fields": {
        "name": "Technician",
        "description": "Learning has become easier for you now, especially in the field of natural science and engineering, you absorb and retain information like a sponge and can mix and match theory and experience with much greater skill.",
        "cost": 400,
        "source": "Alpha Cenaturi",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 65,
    "fields": {
        "name": "I am Iron Man",
        "description": "You're not the ACTUAL Iron Man, but you could make a fairly decent knock-off. Power armors, sonic cannons, holographic interface, laser weapons, repulsor technology, you have the knowledge to build these things and more. Furthermore, you can think of different upgrades and modifications to adapt to different situations much easier than normal when presented with a problem that's hampered your technological progress.",
        "cost": 400,
        "source": "MCU",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 66,
    "fields": {
        "name": "Reverse Engineering",
        "description": "Bizarre alien technology, super­robots, genetic engineering. You might not know these disciplines, but with just a single example to test to destruction, you should be able to figure out how it (used) to work, how to apply the principles to new tech, and with a few projects under your belt, remake the original!",
        "cost": 400,
        "source": "Sekirei",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 67,
    "fields": {
        "name": "Demigod Atelier",
        "description": "You know the secret science of Mantra technology and can build custom devices that are powered by prayer or emotion. Further, you can enhance or upgrade items from other jumps to use this same power source. If you take Cyborg Hindu Godbody, you may construct Demigod cybernetics for other people. After the jump concludes, you may also build Mantra Reactors. Demigod Atelier allows you to create any mantra­powered or integrated device, up to and including the vast fleets of Shinkoku Tratstrium, the heavenly vessels of the divine armies, and even the anti­Gohmaplatform Brahmastra. The latter however would require millennia of effort, and was never completed even in the scope of the original setting.",
        "cost": 400,
        "source": "Asura's Wrath",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 68,
    "fields": {
        "name": "Skills",
        "description": "Weapons: Knowledge in the operation and repair of personal and mounted weaponry. Medicine: Training and knowledge in First-aid, diseases, surgery, anatomy, health and nutrition. You're a fully qualified doctor of the 24th century. Robotics: A combined study of mechanical engineering, and computer science. You learn how to make a wide array of machines, and you could even figure out Android or Borg technology if you studied it enough. Physics: How the universe works. The law of gravity, the conservation of matter & energy, quantum physics, etc. Remember though, there are dozens of creatures in this universe that defy the laws of human physics, so you may want to try and rewrite a few of these books while your here. Physical Sciences: Understanding of the natural laws which govern the physical world. Biology, chemistry, geology and ecology. Again, you may want to rewrite a few of these books while you're here. Engineering: You've been trained in the maintenance and repair of Starships. Not only do you have a significant amount of mechanical and computer knowledge, but you also know a great deal about physics.",
        "cost": 400,
        "source": "Star Trek: TNG",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 69,
    "fields": {
        "name": "upgrades! Upgrades!! UPGRADES!!!",
        "description": "You can make it all better .By studying a piece of technology for a short while, you can come up with ways to improve its functions or fix design flaws, though you’ll still need the related technical skills to figure out details. In addition, you can use salvaged materials in lieu of fresh parts for this task.",
        "cost": 400,
        "source": "Red Faction",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 70,
    "fields": {
        "name": "Arch-Magos",
        "description": "Skill in using and repairing arcane technologies including Archeotech and Xenotech.",
        "cost": 500,
        "source": "40k Redux",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 71,
    "fields": {
        "name": "The Plecian Tome",
        "description": "The Pleician Tome is a portable font of certain archives, templates and pieces of ancient lore, created by a senior Tech-priest of the Adeptus Mechanicus and used by Techmarines. Even to a trained eye, the information is a seemingly random collection, with no easy means of navigation, and so it takes much study to glean anything relevant to a particular task. Indeed, only those with a wide knowledge of Machine Spirits and engine lore have any hope of understanding the information contained within, however, those with patience and the appropriate skills can find secrets of great use within the datacore, secrets dating back to the fabled Dark Age of Technology.",
        "cost": 500,
        "source": "Light of Terra",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 72,
    "fields": {
        "name": "Pagan Science",
        "description": "You've managed to uncover some of the secrets of old, the very same knowledge that underlies 'Sakurai Theory', the theoretical basis of the Symphogear system. With this knowledge, many of the more mysterious functions of the Symphogears become clear. You can repair and install new functions into Symphogears, that manipulate existing features, like forcing a berserk state or tuning it to raise synchronization coefficients. What's more, your glimpses into Sakurai theory indicate some possibilities of inducing Human-Relic fusion, but to complete the theory you'll need an existing test subject...",
        "cost": 600,
        "source": "Senki Zesshou Symphogear",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 73,
    "fields": {
        "name": "Feel It Out",
        "description": "Your ability to understand machines and designs are more than just knowledge, and anyone who follows your work would know this well. You have a subtle psionic ability to 'understand' the machines and items that you physically touch, to the point where you can understand how it might work. More importantly, what you could do to also make it better. Naturally the more complex or esoteric the item is, the more drastically the time needed increases. But the more information you collect the more ideas and methods you can formulate to begin working.",
        "cost": 600,
        "source": "F.E.A.R.",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 74,
    "fields": {
        "name": "Inventor",
        "description": "You are a brilliant (if eccentric) Inventor. You can (within reason) create nearly anything you can imagine if you put in the time. You have a cabinet full of doomsday devices and would be more than capable of slapping together Reverse Scuba Suits for fish or Death Clocks.",
        "cost": 600,
        "source": "Futurama",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 75,
    "fields": {
        "name": "Xenoarchaeologist",
        "description": "For whatever reason, understanding the civilizations of old means you're able to understand alien technology a lot better. You may not know everything off the bat, but upon first sight you have an idea of what it was meant for... and the longer you look at it, the more information you can glean. Fiddling with it will let you familiarize yourself with it more quickly.",
        "cost": 600,
        "source": "Stargate SG-1",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 76,
    "fields": {
        "name": "Hard Science",
        "description": "You have knowledge of Academy City's science and technology to rival a scientist with a doctorate and several years of experience under his belt. you are much more intelligent, analytical, and can easily keep your cool under pressure and rein in your emotions. You also gain a Doctorate's worth of Regular Scientific knowledge in the discipline of your Choice. You know the inner workings of recoil mitigating systems and powered armor, but your true specialty is the Esper creation and development process. Given enough time, you might just figure out a way to get rid of the randomness inherent in the process and give x person y ability. Training an Esper to help them reach their maximum potential is child's play.",
        "cost": 600,
        "source": "Raildex Science",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 77,
    "fields": {
        "name": "Independent Innovation",
        "description": "When it comes down to it, you have to take all the advantages you can get-when you get a chance, you take it. This will help. By analyzing foreign or enemy technology, you can not only pinpoint the pillars of ‘Yes, this is why this works like that’, but also find out what they were lacking. You might have to change a few parts of the original design, but overall you can improve on your foe’s failings from data samples and examples alone. Make your Legilis to the foe’s AGE-3.",
        "cost": 600,
        "source": "Gundam AGE",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 78,
    "fields": {
        "name": "Whispered",
        "description": "Due to a Soviet experiment a while ago, you’re one of the exceptionally rare people known as the Whispered. they have an incredibly advanced knowledge of math, science, engineering, etc though each Whispered only specializes in a single area. If they take the time to learn or supplement this with other technical skills, it’s possible to potentially create Black Technology of their own.",
        "cost": 600,
        "source": "Full Metal Panic",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 79,
    "fields": {
        "name": "Tech Expert",
        "description": "You have a full understanding of terran technology, and a proper foundation for understanding alien technology and biology, while you will never truly come to an understanding of zerg biology or protoss technology, the insight you have into them can be used to enhance other technology greatly.",
        "cost": 600,
        "source": "Starcraft",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 80,
    "fields": {
        "name": "Certified Tech",
        "description": "You are one of the brightest minds of the 23rd Century! You now understand Pre-War science, and can even reverse-engineer existing technology to learn how it works, and how to recreate it. Plus, if you can learn the basics of truely alien science, this perk helps you master it the same way.",
        "cost": 600,
        "source": "Fallout",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 81,
    "fields": {
        "name": "Damaged Microchip",
        "description": "While this looks like the damaged CPU from the first Terminator that Cyberdyne used to help build Skynet, it is actually a storage device. This contains information on just about everything that Skynet has ever produced. From the modified T-1 and small Hunter Killers, to the T3000 and Large Hunter Killer Tanks and Walkers. Even information on how to build an AI as advanced as Skynet is in here, along with Time Travel technology. The problem is, not only is the coding not understandable by the average computer, but the damage to it has eliminated some coding. Nothing vital to the schematics, but it is now even harder to piece the information together. It is unlikely to get all of the information out without 100 years of work",
        "cost": 800,
        "source": "Terminator",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 82,
    "fields": {
        "name": "An Order To Things",
        "description": "You can understand how things fit together in abstract or practical ways. Understand how somebody lives (and where they would hide things) by how they set the items around their dwelling, deduce feelings from handwriting, grow a robot, decipher languages too complex for normal humans. Though things that you seek to make happen, rather than deduce where or how it happened, are much harder to pull off. You can see how someone else grew a robot but doing it yourself would take experimenting and progress, though these things move much faster than you.",
        "cost": 800,
        "source": "Gunnerkrigg Court",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 83,
    "fields": {
        "name": "The Maddest Science Yet!",
        "description": "You can create supertech wonders, past mere conveniences into legitimately useful things like advanced starships, ray guns and miraculous devices. You can also enhance technology from other jumps with this skill. Note that trying to build an FTL starship from scratch on an undeveloped world will probably take ten years...",
        "cost": 800,
        "source": "Tenchi Muyo",
        "domain": 2,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 84,
    "fields": {
        "name": "Aerospace Engineering Makes Things Go Fast",
        "description": "You have an intuitive grasp on the mechanics of wind-flow, material sciences, atmospheric drag, tensile strengths, rocketry, so on and so forth, and how it applies to the art of designing vehicles that traverse the sky and space.",
        "cost": 100,
        "source": "Kerbal Space Program",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 85,
    "fields": {
        "name": "Consummate Knowledge",
        "description": "You know everything there is to know about repairing, maintaining, and fueling AFWs. This includes a working knowledge of diesel engines, pneumatic systems, ranged and melee weapon systems, among others.",
        "cost": 100,
        "source": "Ring of Red",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 86,
    "fields": {
        "name": "Black Thumb",
        "description": "You have the skills of an expert mechanic, able to keep vehicles running even in the most inhospitable conditions. Repairing and tuning up engines is your bread and butter, even while they’re still operating. You also have a feel for how to upgrade cars in more esoteric ways; hey, it takes skill to add that many spikes and not hurt the handling!",
        "cost": 100,
        "source": "Mad Max",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 87,
    "fields": {
        "name": "Titan Engineering",
        "description": "Titans are incredibly complex machines, and due to the disposable nature of their use and production, and not designed for easy repair. You've got the deft touch though, and know exactly where to tweak and shore up the structure to keep it purring like it's fresh out of the drop pod for years.",
        "cost": 100,
        "source": "Titanfall",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 88,
    "fields": {
        "name": "PT theory 101",
        "description": "You've been around robots long enough to know the basics behind their engineering, at least in regards to the structure and reasoning behind the more common mechs, including the Earth Federation's standard Gespensts, and the TLI's Grungust Type 1: the example of the average Super Robot. Weapon knowledge also included in regards to both, which is basically ballistics and some small degree of beam weaponry.",
        "cost": 100,
        "source": "Super Robot Wars OG",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 89,
    "fields": {
        "name": "Fine Tuning",
        "description": "A good mechanic can tune AC parts for better performance in specific areas. You're skilled at customizing them even further, at the cost of worsening some other characteristic; you can do things like modify boosters to use extra power for extra speed, or reinforce armor at the expense of added weight.",
        "cost": 100,
        "source": "Armored Core Classic",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 90,
    "fields": {
        "name": "Mechanic",
        "description": "Machines, especially ones that go fast, just speak to you. You have no problem fixing up and tuning any motor vehicle, and can rebuild them after the most devastating crashes. You can keep anything in top condition with just a few simple tools. Of course, you also need to understand the electronics, so hotwiring cars (and sometimes, alarm systems) is not a problem either.",
        "cost": 100,
        "source": "Fast and Furious",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 91,
    "fields": {
        "name": "I Like 'em Big",
        "description": "Your pace continues into your preferences in MS design-along with some basic knowledge of ‘Right, so I take this bolt out and everything falls to pieces without it. Don’t touch it.’ in your head, you can make upgrades to Mobile Suits that revolve around extra armoring and utility-making replacement parts cheaper and easier to install, reinforcing plates and glass, and generally making a unit tankier and sturdier.",
        "cost": 200,
        "source": "Gundam AGE",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 92,
    "fields": {
        "name": "Anaheim Degree",
        "description": "You have the knowledge (and the paper to prove it to people and shove in their faces to establish superiority) of how to build MS. It’s trickier than it looks, honestly. Weight balances, servo designs, energy reserves-it’s all down to a science and you know how to build the basics. Who knows what you can learn from a bit of hands-on training...",
        "cost": 200,
        "source": "Gundam UC",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 93,
    "fields": {
        "name": "Techy",
        "description": "From Knightmares to guns, you know how to build and improve Geass tech.",
        "cost": 200,
        "source": "Code Geass",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 94,
    "fields": {
        "name": "Fingers of Silver",
        "description": "While other kids were building tinker-toy creations, you were fiddling with your dad's car and doing a better job than him. By purchasing this, meddling with machines and OverTechnology is as easy as breathing for you. By getting your hands on something, you can easily figure out how it works and how to copy its inner workings, provided that it wasn't just bullshit magic. The more advanced something is, the harder it may be... but with time and effort, you just might succeed.",
        "cost": 200,
        "source": "Macross",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 95,
    "fields": {
        "name": "Valuable Memories",
        "description": "You have knowledge related to any particular concept-the construction of Megadei, the nature of memories, Bigs, or the creation of chimeras. Paradigm will have a vested interest in you, and will protect you and provide you with funds if you work for them.",
        "cost": 300,
        "source": "Big O",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 96,
    "fields": {
        "name": "Field Meister",
        "description": "Ordinary Meisters have sponsors and workshops lined with tools and mortar headdscraps. After all, that’s their job –to build and tune the mortar he adds which form the backbone of literally every single army in the Joker Cluster. Naturally, they’re highly demanded –especially the ones who have made a name for themselves. You’re not quite there yet, but whereas others have fame, you have talent. While no one will say it to you outright, in reality a lot of people are rather envious of your abilities as a Meister. Perhaps your lack of obfuscating memories made it earlier for you to adapt to the necessary qualities to become one –but your potential as a Meister is so strong that you could  tune and repair a MH even in the middle of a battlefield with nothing other than a plasma torch and some scrap metal .Frankly, you could probably rig up a temporary workshop just with stray tools lying about –but it’s probably best not to tempt fate by setting up permanent shop in the middle of the battlefield!",
        "cost": 400,
        "source": "Five Star Stories",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 97,
    "fields": {
        "name": "MT Engineering",
        "description": "Theoretical and practical knowledge of MT design, construction and programming. Simpler machines than ACs and much more suitable for mass production, they're the workhorse of megascale construction and the backbone of security and military forces. Your skills could earn a pretty cushy job at any of the megas. Being giant robots, these need literal tons of material and lots of labor to make. You could contract out for construction, but the simplest use for this is to design MTs for some corp instead. Also, this perk alone doesn't make you good enough to design or build really top-of-the-line MTs, the kind that might rival ACs.",
        "cost": 400,
        "source": "Armored Core Classic",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 98,
    "fields": {
        "name": "Technical Certainties",
        "description": "Some engineers are always second guessing themselves, sticking to maintenance of machines that others use. You're so sure of your skills that you're capable of altering fighter planes to great effect, making them noticeably better than they were fresh out of the factory. Upgrades will be easy provided you have resources, and your technical prowess will ensure your plane can serve whatever role you wish of it. You could even slave the controls of ground weapons to your computers, becoming a conductor of war from the skies. You might even be knowledgeable enough to build the next superweapon...",
        "cost": 400,
        "source": "Ace Combat",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 99,
    "fields": {
        "name": "Smart",
        "description": "Boosts your ability to think quickly and boosts your IQ by 20points.While this does not grant any innate knowledge, you can potentially learn at three-times the speed as normal humans.",
        "cost": 400,
        "source": "Code Geass",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 100,
    "fields": {
        "name": "Tech Mastermind",
        "description": "You know the insides of almost every VS and the guts of all your weaponry, and can fix them up to full standard and even beyond basic stuff like patching armor-hell, weld 2 VS together, I’m sure you’ll make something great out of it. You also can make just about any sort of technology or weaponry VS-compatible, and you can-with much, much strife-do the difficult task of working on Harmonizer technology.",
        "cost": 600,
        "source": "Lost Planet",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 101,
    "fields": {
        "name": "Superweapons",
        "description": "Your expertise covers the every growing market of weapons of mass destruction. Giant beam weapons that can teleport people everywhere to controlling the weather, if its meant to bring a city to its knees, you know about it. All of these devices however will take a massive expenditure of manpower and resources. Among rare elements that are the cornerstone of the device. Good thing you always know where to get them, good luck with getting past those giant worms!",
        "cost": 600,
        "source": "G.I. Joe",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 102,
    "fields": {
        "name": "Always a Bigger Robot",
        "description": "The design and maintenance of epic machines is your specialty. You can figure out how to build starships measuring several kilometers long or devise a way to make a mountain sized mecha. You'll also have no problems getting past all the laws of physics that should make such creations impossible, perhaps Spiral Energy has something to do with it?",
        "cost": 600,
        "source": "Gurren Lagann",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 103,
    "fields": {
        "name": "Mechanical Genius",
        "description": "You're the leading expert at designing droids and starships. Given the right resources you could create fully autonomous starfighters with built in hyperdrives, battle droids with cheap, stronger and longer lasting shields, hover tanks as fast as landspeeders, androids indistinguishable from organics, and combat droids capable of killing jedi.",
        "cost": 600,
        "source": "The Clone Wars",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 104,
    "fields": {
        "name": "The Good Doctor",
        "description": "With enough time and materials, the greatest works of this day and age will all be by your hand. Refueling stations disguised as meteors, rapiers that double as laser guns, or even a ship as magnificent as the Arcadia – all these might bear your name. Where to get the materials, though?",
        "cost": 600,
        "source": "Captain Harlock",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 105,
    "fields": {
        "name": "A New Age of Warfare",
        "description": "Metal Gear, a weapon capable of bringing an entire nation to its knees (in theory). Your engineering talents have extended to the point you can create these war machines, even automate them with AI, provided you have enough time and resources. With Box-tech you can apply these cutting-edge technologies to combat-ready gear, creating things like man-portable Railguns and Stealth Camo.",
        "cost": 600,
        "source": "Metal Gear Solid",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 106,
    "fields": {
        "name": "Core Competence",
        "description": "You are one of the world's best mech engineers; the corporations would literally kill to have you on payroll. High-performance MTs that compete evenly with ACs are now feasible- these are a bit cheaper and simpler to build than ACs, at the cost of far less customizability. Or, with even more work- probably most of your time in this jump- you might even come up with some sort of next-gen AC that chumps fellow ACs the way ACs chump their MT predecessors. Just don't expect to walk away from the job easily... that non-compete clause is murder.",
        "cost": 900,
        "source": "Armored Core Classic",
        "domain": 3,
        "prereq_perks": [
            89
        ],
        "prereq_addons": [
            15
        ]
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 107,
    "fields": {
        "name": "\"Extensive Research Notes\"",
        "description": "Not a modification to your Knight itself, no. This is instead a pile of research journals filled with numerous notes and schematics detailing the processes behind the creation and modification of Knights, Knight Weapons and Knight's Arcs. The journals mention an ancient school of magic used to craft these weapons of war, but it bears a heavy resemblance to another school that seems very familiar. . .",
        "cost": 1200,
        "source": "White Knight Chronicles",
        "domain": 3,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 108,
    "fields": {
        "name": "Scientist",
        "description": "You have a DOCTORATE! And skill in ACTUAL SCIENCE! That doesn’t need you to go crazy to work! Admittedly, it won’t break the fabric of space and time, but meh. Tradeoffs everywhere you go. You’re highly trained in one field, and can easily apply its principles to your work. After all, building a crazed abomination upon the natural order usually requires at least a smidgen of understanding of which bones are supposed to go where (Even if you end up changing them around a little). At the very least, you’re also in the genius range of standard intelligence.",
        "cost": 100,
        "source": "Girl Genius",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 109,
    "fields": {
        "name": "Don't Need A Team",
        "description": "Fighter planes are pretty complicated machines, and more often than not you need a whole crew to maintain them so that they don’t break down in the middle of a fight and doom the pilot. You know your plane well enough to circumvent this issue. You've got just the right idea on what needs tuning up and what needs fixing, along with having the speed to be able to fix a plane up by yourself without the need for a crew in a fraction of the time. Performance issues are a thing of the past for you.",
        "cost": 100,
        "source": "Ace Combat",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 110,
    "fields": {
        "name": "Machinist",
        "description": "You are an expert mechanic. You can rebuild and improve a helicopter in 12 hours or create a functional motorcycle from spare parts. If honed, this ability will let you make nearly anything from incredibly advanced robots to nanite swarms in only a few months’ time.",
        "cost": 200,
        "source": "Gargoyles",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 111,
    "fields": {
        "name": "Workaholic",
        "description": "Sometimes you wonder how some geniuses are able to build entire armadas within days or weeks of their last defeat. You become a walking factory of production. Building in masse is something that comes without issue to you. That one bot that took a week to build? Now that one bot is now 5. Or roughly 3x the size it was before. How do you even have the resources to build so much you say? The hell if I know.",
        "cost": 300,
        "source": "Sonic",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 112,
    "fields": {
        "name": "Manufacturing Line",
        "description": "You've always been of the opinion that technology advanced too slowly before you arrived, but now you can apply that to the physical world as well! Any building process you oversee, whether it be the forging of a sword or an entire tank factory, will now produce results twice as fast and with half the required materials used.",
        "cost": 400,
        "source": "Valkyria Chronicles",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 113,
    "fields": {
        "name": "Researcher",
        "description": "You are far faster at designing and discovering new technologies. Inspiration and breakthroughs hit you far more often",
        "cost": 400,
        "source": "Age of Mythology",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 114,
    "fields": {
        "name": "Shipping the Product",
        "description": "Prototypes are one thing, but what about actually getting the damn thing distributed? An item or weapon doesn't help anyone if it's the only one of its kind. You will find your ability to create has increased dramatically in efficiency, letting you use the materials for three of the same items to actually make five while streamlining production lines rather quickly. As a bonus, logistics have increased enough where your shipped supplies are harder to intercept, keeping any allies you have fresh with resources!",
        "cost": 400,
        "source": "F.E.A.R.",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 115,
    "fields": {
        "name": "Savvy Sultan",
        "description": "When people think of building things, they think of you. Provided you had the resources and the understanding of the technology, you could construct all manners of machines in a fourth of the time it would normally take. By yourself. You're no slouch with any of your tools either, wielding them with the precision of a machine with no loss of speed. Quality and a deadline? No problem.",
        "cost": 400,
        "source": "Macross",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 116,
    "fields": {
        "name": "We Need Reserves",
        "description": "When you’re fighting a war, you know what you need-you need troops, you need squadrons; you need a fully-armed army. You can’t fight a war without numbers, and so you can modify designs to give you just that-numbers. Your MS production capability will multiply to near 4x levels, with only a negligible decrease in quality. You can also, with time and patience, apply this design philosophy to other products.",
        "cost": 400,
        "source": "Gundam AGE",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 117,
    "fields": {
        "name": "Most Holy Order of the Socket Wrench",
        "description": "You are a master mechanic. Repair and upkeep is nice, but you can go beyond the impossible and improve any vehicle. Take a van and make it beat a supercar? Put NOS injectors on a bicycle (and make it work)? How about something challenging? And anything you can build up you can tear down, too. You're a one-man chop shop and wiring a car to explode takes but a few moments and some chicken wire.",
        "cost": 400,
        "source": "Fast and Furious",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 118,
    "fields": {
        "name": "Build Rome",
        "description": "You have a thing about building things-you’re damn fast, and you’re damn good. They say you can’t build 10Mobile Suits in a week? Hah! You’ll build twice that much and you’ll build them to last! You simply have utter talent in the way of making things quickly-enough to double production, maybe even triple production if you work at it enough, and they’ll come out with no loss of quality. In addition, these constructions will last-barring sudden disaster and similar, they’ll easily last several decades of constant abuse, and if they’re upkept and repaired they could even last centuries with no troubles.",
        "cost": 600,
        "source": "Gundam: After Colony",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 119,
    "fields": {
        "name": "One-Man Assembly Line",
        "description": "You really liked playing with building blocks as a kid. Now that you're all grown up, the world is your playground. Your knowledge of construction and engineering is unprecedented, and making a jet engine from spare parts over a weekend is your idea of fun.",
        "cost": 600,
        "source": "XCOM",
        "domain": 4,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 120,
    "fields": {
        "name": "Gunsmith",
        "description": "People always forget that all Guns need some sort of maintenance, thankfully unlike other people you know and can easily maintain as well repair most modern guns, and you also got a solid basis for learning how to maintain and repair or customize almost any gun that you can get your hands on, in fact your skill right now is good enough that you can at least ensure that whatever gun you clean up and maintain personally will never jam for whatever reason, who knows what you will be able to do in the future.",
        "cost": 100,
        "source": "Alpha Protocol",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 121,
    "fields": {
        "name": "Craftsman",
        "description": "You gain the needed knowledge to perform a particular craft be it farming, cooking, leather working or so on. This Perk can be taken multiple times to better prepare you for what is to come.",
        "cost": 100,
        "source": "Dorf Fortress",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 122,
    "fields": {
        "name": "Weapon Modifications",
        "description": "You design and modify weapons with flair, creativity and skill.",
        "cost": 100,
        "source": "Archer",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 123,
    "fields": {
        "name": "Customized Weapons",
        "description": "You know that efficiency is number one, because waste is a thief. You know how to make the best designs better, and will ensure that the equipment in use is ergonomic, streamlined, and efficient.",
        "cost": 100,
        "source": "XCOM",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 124,
    "fields": {
        "name": "Bandit Gunsmith",
        "description": "You have amazing technical insight and when shown to a pile of broken weapons or energy shields youcan use parts from some to reassemble others into decent condition. Don't expect it to be pretty, but you can nail 15 repeater pistols together to make a functional shotgun, or use bits of five shields to make one that works",
        "cost": 100,
        "source": "Borderlands",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 125,
    "fields": {
        "name": "Fingers of the North Star",
        "description": "You have a natural talent with machinery, and this extends to firearms creation. You can disassemble, analyze, and reassemble any projectile weapon you come across, and you have the ability to create unique, one of a kind guns that utilizes odd and esoteric technology. You also gain a free 'stamp' you can apply to any weapon you create, to show it's your work. Upgrading existing weapons is a breeze as well.",
        "cost": 200,
        "source": "Cave Story",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 126,
    "fields": {
        "name": "Smithing",
        "description": "The ancient art of working with metal to forge weapons and armor. You know how to make beautiful equipment that can survive countless battles and you could even forge a legendary weapon if you dedicated enough time to it, although it'd probably take at least several years to complete.",
        "cost": 200,
        "source": "Thundercats",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 127,
    "fields": {
        "name": "Infinitely Customizable",
        "description": "It's not that your guns are bad, by any stretch of the imagination, it's just that they could be so, so much better. And now you can actually do that. In this world, tools and weapons are aided by nano-scale circuitry, which leaves a lot of room for improvement, typically in the form of power nodes being welded into specific places to provide extra power to certain subsystems of the weapon, to increase power output, ammo count/efficiency, and even unlock special abilities, like setting enemies on fire, or exploding violently. As an added benefit, you also get the ability to break weapons and tools down into parts-specifically frames, tools, tips, accessories, and upgrade chips, see the Notes section for more information-and reconfigure them to your liking. You can even upgrade those parts individually using power nodes.",
        "cost": 200,
        "source": "Dead Space",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 128,
    "fields": {
        "name": "Weapon Crafting",
        "description": "Alright, so you fancy yourself a weapons dealer, huh? Well now you know the ins and outs of every single tool made for killing that you get your crafty little hands on. Swords, handguns, axes, sniper rifles, spears, rocket launchers, it'll all come naturally to you, and you will be able to create these weapons or even improve them with your own custom designs. And to make it even a better deal, you know how to modify a weapon to have unlimited ammunition capability. So go nuts, buddy. You've earned it.",
        "cost": 200,
        "source": "Devil May Cry",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 129,
    "fields": {
        "name": "Blacksmithing",
        "description": "You gain understanding of Weyard blacksmithing. While skilled in smithing typical metals, you also learn how to use strange and magica lmaterials to forge powerful enchanted weapons, equipment, and artifacts. Power is decided by your personal skill, the magic of the material involved, and the quality of your forge. Items created with materials from Weyard typically require the user to be an adept to tap into their strength.",
        "cost": 200,
        "source": "Golden Sun",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 130,
    "fields": {
        "name": "Smithing",
        "description": "you know how to make weapons and armour from all sorts of raw materials. From scarabug wings to Blibli Tusks and Gobball hooves, you can turn just about anything you'd find in nature into genuine combat equipment! the more powerful the creature it came from, the stronger the equipment will be.",
        "cost": 200,
        "source": "Wakfu",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 131,
    "fields": {
        "name": "The Arcane Craft",
        "description": "As much as you might look down upon brutes and barbarians who know only how to break bone and spill blood, you and the warriors of this land have one thing in common. You require the tools of your trade. You know all the methods and ways to bind arcane and mysterious forces into physical vessels. Rings, staves, talismans, warded stone towers, and even more. These items allow the channeling of such forces to work your will, capturing, bending, and shaping the worlds invisible tides to enable works of sorcery and occult splendor. The strength of these items and their effects rely on your skill, knowledge, and power. Of course should you yourself be a font of such forces from your varied lives then you would be surely capable of building the focuses and talismans to augment and amplify your power. The world rewards men for diligent labor. It would behoove you to refine this art to get everything you can out of it. This also includes the skill to use such items, even those not made by your hand should you have the ability to reveal their secrets.",
        "cost": 300,
        "source": "Sword and Sorcery",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 132,
    "fields": {
        "name": "Workshop Artisan",
        "description": "As if taught at the long gone workshop, you seem to possess knowledge and skill with many of their crafting techniques. You have been granted the knowledge and skills needed to both repair and even create your own Trick Weapons and Hunter's Tools. Trick Weapons are weapons with a variety of special abilities relating to their form. The most common type of Trick Weapons are those that can transform in some manner. An example being swords that can lock into specialized sheaths in order to become different weapons, sometimes radically so. Not to say transformation is the only ability, there are also melee weapons with guns attached, and maces that can be charged with unnatural blue electricity to deal massive damage. Hunter's Tools are pieces of equipment with special abilities activated by using Blood Bullets or Quicksilver Bullets as a medium. Hunter's Tools are usually supernatural items that have been made to work using a Blood/Quicksilver Bullet medium, such as the Beast Roar, a beast's claw that when activated, allows the wielder to roar like a beast. Some Hunter's Tools are completely manmade as well, though this is a relative minority. Basically, you now know how to convert things into being activated and powered by Blood Bullets and Quicksilver Bullets. Doing so allows anyone to use them, even if they are completely mundane beings, so long as they have the bullets mentioned above on their person. When making Hunter's Tools, remember that the more power something requires, the bullets the wielder will need. These skills granted to you may be honed over time, just as any other skill can.",
        "cost": 300,
        "source": "Bloodborne",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 133,
    "fields": {
        "name": "Master Craftsman",
        "description": "You are exceptionally skilled at crafting things. At your worst, your results are masterwork.",
        "cost": 300,
        "source": "Forgotten Realms",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 134,
    "fields": {
        "name": "Blacksmithing",
        "description": "Smith various melee weapons, mail and plate armor, and other useful trade goods like skeleton keys, shield-spikes and weapon chains to prevent disarming. Blacksmiths can also make various stones to provide temporary physical buffs to weapons. Zen Master: At this level you've mastered everything from basics to advanced. Additionally you've expanded your knowledge of the profession beyond the mastery of both basics and advanced stuff to complete understanding of it. At this level you're on even playing field with top 1% of your profession. Should you write down your knowledge it would easily be considered a work of art in that field.",
        "cost": 300,
        "source": "World of Warcraft",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 135,
    "fields": {
        "name": "Armourer",
        "description": "A mental database containing information on the most common types of armour found in the Necromunda Hive and how to build, repair and maintain them. While this doesn't sound impressive, it is worth pointing out there are countless billions of people dwelling within the hive, and they have been here for millenia - the list of things counted as common at one time or another ranges from Power Armour in the distant past to the more common hammered metal plates made by local Gangers to the standard Imperial Guard Carapace Armour. Don't expect to start churning out Adetus Astartes Power Armour the second you get this though - the infrastructure to build the infrastructure to build the infrastructure to build the armour was lost to ruin a long time ago. There's a reason the Space Marinesuse suits thousands of years old.",
        "cost": 300,
        "source": "Light of Terra",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 136,
    "fields": {
        "name": "Tempered Soul",
        "description": "You gain a innate gift for forging high-quality weaponry. The weapons you create do not appear crude in any sense of the word, and in time your skill might cause your functional weaponry to be confused for elaborate display items.",
        "cost": 300,
        "source": "Soul Calibur",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 137,
    "fields": {
        "name": "High-Frequency Manufacturer",
        "description": "A blade launderer, huh? Anyways, you can now make HF blade out of anything you want. Depending on the original craftsmanship of the weapon, it could be good or shit. But if you picked this, you probably have something in mind. Must be a physical object. No lightsabers and the like. Yes blunt objects can become HF weapons. No, they can't cut. They only get stronger, and can resist other HF weapons.",
        "cost": 300,
        "source": "Metal Gear Rising",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 138,
    "fields": {
        "name": "Smith",
        "description": "You are professional smith with all the skills to craft any tool, weapon or armor. You even know the rare smelting and forging techniques needed to work with magical ore.",
        "cost": 300,
        "source": "Gothic",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 139,
    "fields": {
        "name": "Engineer",
        "description": "You're more adept at coming up with novel and creative objects. Any blueprint can be held perfectly in your mind without needing to draw it on paper.",
        "cost": 300,
        "source": "Super Mario RPG",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 140,
    "fields": {
        "name": "I Can Fix It!",
        "description": "Technology is a wonderful thing, and you discovered that long ago. You have a knack for Flame rings and machines of all kinds, and can fix or maintain most machines. You can even improve them to beyond their normal specs. Comes with its own toolbox.",
        "cost": 300,
        "source": "Reborn",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 141,
    "fields": {
        "name": "Crystal Metallurgy",
        "description": "You figure that it would only be a matter of time until somebody attempted to forge a suit of armor out of crystal. Frankly, with the materials available and the tools there, it's more of a surprise that it hasn't happened already. Of course when you actually try it, you'll realize why -the magic surrounding the crystals is simply too strong to be forged using traditional means. But if traditional means won't work, that just tells you that you need to employ more esoteric means of forging. Forging not with traditional fire, but with the concentrated essence of Aether and fire crystals, you can bring to life a suit of armor with crystal alone -retaining its Aether collecting properties, and magnifying the effects of spells all around it. Perhaps with time, you might be able to make golems with this...",
        "cost": 400,
        "source": "Final Fantasy XIV",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 142,
    "fields": {
        "name": "Blessing of Dundr",
        "description": "You received the blessing of Dundr as he left the world, and received the boon of the god of smithing and knowledge. You gain godly talent in learning how to smith and can weave stories that capture and entertain people on equal footing of the greatest bards.",
        "cost": 400,
        "source": "The Banner Saga",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 143,
    "fields": {
        "name": "You Became A Star",
        "description": "you've gained insight into the process of using rainbows to harness Unicornium without having it explode in your face. With it, you can build your own robot unicorns or other rainbow creatures. Once your initial adventure here concludes successfully you will be taught by an expert wishsmith on everything you might need to know to construct Wishes and design your own upgrades for them.",
        "cost": 400,
        "source": "Robot Unicorn Attack",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 144,
    "fields": {
        "name": "Dwarven Craft",
        "description": "You are a master smith, able to singlehandedly run even a large forge. You can make weapons and armor that stand up to hundreds of years of continuous use, and even know how to mine and forge mystical metals such as Mithril.",
        "cost": 400,
        "source": "Lord of the Rings",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 145,
    "fields": {
        "name": "Gadgetron License",
        "description": "Okay, here we go. You know how to craft the various kinds of weapons and armors this jump is famous for. Anything from a blaster all the way up to a RYNO, you have a pretty good idea how to invent, make and maintain. Not just gadgetron, but megacorp tech is also fair game. You know it all, just please use this information responsibly. It’s pretty crazy.",
        "cost": 600,
        "source": "Ratchet & Clank",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 146,
    "fields": {
        "name": "Labyrinth Creation",
        "description": "The Moon Cell creates entire Reality Marbles to simulate each area in the Grail War, including the Lunar Seas where Servant Battles take place. While you're not able to replicate this incredible feat, you can being to create Lunar Sea like pockets of your own. While you can always decide the general theme to the dungeon and it's enemies, at first, these will be small dungeons, perhaps only a dozen rooms and connecting hallways, and filled with weak fodder that will only drop cheap items. As you grow more experienced, all these parameters will expand. Eventually you could create grand labyrinths with multiple floors and dozens of rooms a piece, enemies will grow in strength and their item drops will increase to match. You do not have any more control over this however, at most you may simply choose the general size and strength of each dungeon, nor will the enemies within ignore you.",
        "cost": 600,
        "source": "Fate/Extra",
        "domain": 5,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 147,
    "fields": {
        "name": "Avid Glove",
        "description": "A miracle of surgery and tailoring, though it may bite any hands shaken. Who can say no to another set of eyes and fingers?",
        "cost": 100,
        "source": "Fallen London",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 148,
    "fields": {
        "name": "Talented: Tailoring",
        "description": "You are an expert at any non-combat related skill. Cooking? You can make a five star meal with low rate ingredients.",
        "cost": 100,
        "source": "Inukami",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 149,
    "fields": {
        "name": "Requiem of souls",
        "description": "You have been taught the sacred song of the Cocoon Masters, which allows you to soothe a Minion's raging heart. By playing this song to a weakened monster, you can capture it inside of an empty cocoon. The more damaged the creature is, and the more skillful your playing, the more likely you are to capture it. You can play the song again to release them, but by itself the Requiem will not make them loyal to you. This gives you basic proficiency in a musical instrument of your choice.",
        "cost": 200,
        "source": "Jade Cocoon",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 150,
    "fields": {
        "name": "Tailor Made",
        "description": "You have the knowledge of how to weave magic into clothes, making them incredibly durable and protective. They're capable of protecting the wearer from most things, including bullets, knives, magic, extreme heat, and large amounts of blunt-force trauma. They also look damn stylish.",
        "cost": 200,
        "source": "Skullduggery Pleasant",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 151,
    "fields": {
        "name": "Putting On The Reich",
        "description": "They may fear your tenacity. They may hate your cause. They may even oppose your beliefs. But one thing remains constant: A begrudging respect for the aura of organization and sharpness you give off. You have an excellent sense of how to design uniforms that not only are intimidating and show the power of your group, but are also fashionable and make your group look organized, official in a way. It's time to show them who's Boss.",
        "cost": 200,
        "source": "Indiana Jones",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 152,
    "fields": {
        "name": "Coordinated Outfits",
        "description": "It seems that having a theme to your clothing has increased its power. Either that or everyone’s crazy about your sharp outfit.",
        "cost": 200,
        "source": "Kingdom of Loathing",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 153,
    "fields": {
        "name": "Juggernaut",
        "description": "Your armor is a lot more effective at doing what it does just by the sheer virtue of it being latched onto and wrapped around your fleshy bits. Not to get too far into the math of it, your armor is about half-again more effective than it would be otherwise.",
        "cost": 200,
        "source": "Terraria",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 154,
    "fields": {
        "name": "Fashion",
        "description": "Your clothing and entire body acquire defensive properties equal to the most superior protective items you have currently equipped. Emphasis on protective item­ an iron or steel ring won’t give you metal­tough skin­ the minimum is things like knee pads from extreme sports, helmets­ even an apron would count, though all that’d do is protect you from the dangers of a kitchen...",
        "cost": 200,
        "source": "High School of the Dead",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 155,
    "fields": {
        "name": "Fashion Nonvictim",
        "description": "For you, there is no such thing as suffering for the sake of fashion. As long as you wear fashionable clothing, you will always be perfectly comfortable no matter the weather. You can make ill-fitting clothing look good on you with a couple subtle pins in the right places, and it'll always be comfortable no matter how big or small it is. Even in the thick of battle, you will be no worse off for your lack of armor- So long as you wear a single piece of armor, like a shoulderpad or gauntlet, your clothes will protect you as if they were a suit of armor made of the same material.",
        "cost": 200,
        "source": "The World Ends With You",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 156,
    "fields": {
        "name": "Secular Skills",
        "description": "Through growing up in a society in which religion tried to stem the natural instincts of the cat people towards vanity and good looks, you learned to craft amazing clothes and outfits from the most base materials and tools, and don’t worry they all will look fantastic.",
        "cost": 200,
        "source": "Red Dwarf",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 157,
    "fields": {
        "name": "Garment Gloves",
        "description": "These are a pair of pure white gloves. Bound to them is an intelligence with a mind for fashion: a designer, seamstress, clothier, and tailor without mortal peer. It has the ability to scry for fashion based information­ from international trends to precise measurements. Given materials and orders, it will industriously produce fine apparel, producing any modifications, clothing, footwear, accessories, etc that is within theoretical mortal ability. It has sufficient telekinesis to move itself and to independently suspend materials. It must be provided with materials, though it may be provided a lump sum or budget with which to magically acquire materials at cost. You may wear the gloves to channel the skills (but not powers) of the entity, perhaps even learning from it.",
        "cost": 200,
        "source": "Dodgeball",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 158,
    "fields": {
        "name": "Profession: Tailoring",
        "description": "Sew cloth armor and many kinds of bags using dye, thread and cloth gathered from humanoid enemies during your travels. Tailors can also fashion nets to slow enemies with, rideable flying carpets, and magical threads which empower items they are stitched into. Zen Master: At this level you've mastered everything from basics to advanced. Additionally you've expanded your knowledge of the profession beyond the mastery of both basics and advanced stuff to complete understanding of it. At this level you're on even playing field with top 1% of your profession. Should you write down your knowledge it would easily be considered a work of art in that field.",
        "cost": 300,
        "source": "World of Warcraft",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 159,
    "fields": {
        "name": "Sea Snail Shells",
        "description": "You have a small breeding population of around 10 Super Sea Snails, large snails with crystalline, conical shells. The snails are hermaphroditic but and they live for around 15 years. They're more than they seem, though-they provide an invaluable service- Their shells can be used to imbue hats, shirts, and pairs of shoes with extra Ability Slots, or reroll the abilities of a clothing item with 3 full slots. This kills the Sea Snail, but if you're careful to keep up the population then eventually you might have an entire wardrobe of 3-slot clothing. Also, they're delicious when cooked right.",
        "cost": 300,
        "source": "Splatoon",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 160,
    "fields": {
        "name": "Tailor",
        "description": "You have the knowledge of how to safely work with life fibers, and how to make them into clothing that empowers (or inhibits) the wearer. In addition, because you know how Life Fiber uniforms work, you know their weak spots better than anyone.",
        "cost": 300,
        "source": "Kill la Kill",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 161,
    "fields": {
        "name": "The Flock's Fleece",
        "description": "Men and women have not wandered the wilds naked since the long-gone days of the Garden. Whether they knew it or not, the act of clothing oneself is one that atonce protects and isolates. A shirt or a robe is a metaphorical armor against the elements, against shame and against the prying eyes of others. You are such a skilled craftsman that you can take the 'metaphorical' part out of the equation. You're a one-person clothing creator and tailor, able to take the raw materials of silk, cotton, wool and hide...and then with almost no tools produce wondrous clothing, fitted just right for anyone who dares try the garments on. They're protective vestments against the harsh elements, able to keep people in comfortable condition be they in the deserts of Kasandora or the icy plains of Northwall. Not only that, but people who wear them find that they'll be kept safer from the claws of beasts or the swords of their enemies, acting as a light chain-mail mesh despite being softand maneuverable fabric.",
        "cost": 400,
        "source": "Actraiser",
        "domain": 6,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 162,
    "fields": {
        "name": "Inner Linings",
        "description": "A customer came to you one day with a strange request for you to make a leather jacket which would be thinner, enough so that it would take multiple jackets to equal the bulk and weight of a normal jacket. As strange as that request was, when you watched him enchant the various jackets it suddenly made sense. Instead of trying to enchant a single jacket multiple times, he would wear multiple jackets enchanted once. But you can improve on that idea. Instead of attempting to craft multiple thinner jackets, you’ve opened up inner linings in existing pieces of work. As you predicted, while the ease of stacking enchantments has gone up, the overall durability of the item has dropped by a bit. Perhaps with time and better materials, you could rectify the second point. Having so many inner linings also helps quite a bit when it comes to deeper pockets, which is a nice side effect",
        "cost": 100,
        "source": "Final Fantasy XIV",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 163,
    "fields": {
        "name": "Ars Magus Creation",
        "description": "You have basic education in the creation and modification of Ars Magus. You understand how they work and how to create non-combat Grimoires, though you require time and resources in order to do so.",
        "cost": 100,
        "source": "Blazblue",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 164,
    "fields": {
        "name": "Heretical Adaptation",
        "description": "Symphogears are, in essence, a Relic adapted into a combat system for it's ability to generate massive amounts of energy that can be formatted into a certain kind of matter through a generic mass-energy converter. However, they also have the ability to 'evolve' overtime, gaining additional armor and improvements to features such as onboard thrusters. With a bit of study, it might be possible to apply this adaptive behavior to other materials, encouraging them to improve themselves over time.",
        "cost": 200,
        "source": "Senki Zesshou Symphogear",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 165,
    "fields": {
        "name": "Augment Blade System",
        "description": "A warrior needs a trusty weapon, and with blacksmiths in short supply, it seems that most people have taken to modifying and improving their own equipment. The main technique the survivors in this world seem to use allows weapons to grow as individuals might –learning from experience gained in live combat. For as long as you continue to wield a weapon and use it, it will grow in terms of all its basic qualities, including traits like durability, strength, and ease of use. Should you switch weapons or pass your weapon on to another, the growth will stop until you pick that weapon back up again to focus on it. However, it will retain any experience it has already accumulated, so there’s no worry of your work being lost over time.",
        "cost": 200,
        "source": "Dark Cloud 2",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 166,
    "fields": {
        "name": "Artificer",
        "description": "You begin the game already knowing the magics to create enchanted items (other wizards can eventually acquire them) and artifacts. Additionally, these items cost half as much for you to make, and take half the time. This allows you to equip heros you hire in the early game. In future jumps, this will provide a slight boost to the creation time and a reduction to the creation cost of magical items",
        "cost": 200,
        "source": "Masters of Magic",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 167,
    "fields": {
        "name": "Weapon Absorption",
        "description": "Were the Moon People the ones who developed weapons as they exist in the world today? Perhaps, with their technological expertise, they tampered with such things -but we may well never know. Your weapons modified with this will adapt the concept of \"experience\", allowing them to grow as more enemies are defeated with them. As more enemies are defeated, you can absorb other weapons into the base template -improving the qualities of the original weapon.",
        "cost": 200,
        "source": "Dark Cloud",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 168,
    "fields": {
        "name": "Minor Enchantment",
        "description": "Make boots that will always fit or makeups that change to your whims. These magical tricks have a very wide range of applications but will generally not be on a very grand scale; though the utility from walking on walls is not to be denied.",
        "cost": 200,
        "source": "Gunnerkrigg Court",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 169,
    "fields": {
        "name": "Transcendence",
        "description": "Transcendence, the act of rebirth, allows for the expansion from second job upwards to yet another profession above that. Each class has its own transcendent class, as seen in the table below. Furthermore however, the act of transcendence carries its own effects. The Mastersmith can socket items –allowing him to add “slots” where modifications can be implemented onto items. While intended for cards, these can be used for other modifications which need slots if need be.(but effectiveness may be reduced)",
        "cost": 200,
        "source": "Ragnarok Online",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 170,
    "fields": {
        "name": "Magic: Enchanting",
        "description": "You can grant magical properties to weapons by marking them with ancient runes. Right now you only know how to give weapons elemental properties, but you can learn more enchantments by studying other enchanted and magical weapons.",
        "cost": 200,
        "source": "Samurai Jack",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 171,
    "fields": {
        "name": "Maliwan Intern",
        "description": "At some point, you got lucky and figured out how Elemental Weapons really work. You know how to use them to best effect, allowing you to set enemies on fire regularly, melt people with acid bullets, and have ALL kinds of shocking adventures with electrical ammo. If you have any technical training, you can even jury-rig ways to apply elementa leffects to other weapons, as well.",
        "cost": 200,
        "source": "Borderlands",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 172,
    "fields": {
        "name": "That Undefinable Thing",
        "description": "Even if you can't describe it, you can still manipulate it. You can now make physical tools and containers for souls, as well as gaining the knowledge of how to use the soul as a power source for magic, machinery, and living bodies. Given proper resources (raw souls), you can create Exspheres and Key Crests­ which can then power the things mentioned in your place .Anything powered by their user’s soul is known intimately to them, inhabited by the soul the same way a body is inhabited by a soul. It becomes in all ways an extension of the self, for good or ill. While the soul is infinite, it can be diminished and grown. Take care.",
        "cost": 300,
        "source": "Tales of Symphonia",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 173,
    "fields": {
        "name": "Synchronicity Event",
        "description": "Curiouser and curiouser. Due to coming into contact with... well, SOMETHING, your psionic abilities have noticeably increased. Psychic powers you may have had are stronger now, with control and development coming more quickly with practice. There is also a boon to this; by taking a few days to 'attune' a person, you may impart upon them the beginning of psionic abilities of their own. You may only gift one school at a time, and they start at the very beginning; if they are to grow and learn as you have, it would be wise to teach them. On the plus side, they’ll eventually become as strong as you are, so you’ll have quite the pupil on your hands.",
        "cost": 300,
        "source": "F.E.A.R.",
        "domain": 7,
        "prereq_perks": [
            73
        ],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 174,
    "fields": {
        "name": "Glove of the East",
        "description": "This hand of mine glows with an awesome power! It's burning gri-... oh! Sorry, wrong show. This single glove comes in any color and style, and is actually quite useful! You can channel your spiritual energies through it to help you with mundane tasks; your cooking might turn out excellent, cleaning takes less work for better results, and massages work WONDERS when you hit those points. If you channel a LOT of spiritual energy, you might even imbue items and equipment to improve them and be more receptive to your spiritual/chi powers! Heart symbol optional.",
        "cost": 300,
        "source": "Binbougami ga",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 175,
    "fields": {
        "name": "Artifice",
        "description": "You have a gift for the creation of powerful magical items. As True Artifacts their magic won't ever run out, or at the very least won't run out for a very long time. What you can make is limited to your knowledge, your imagination, and your resources.",
        "cost": 300,
        "source": "Avernum",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 176,
    "fields": {
        "name": "Soul Smith",
        "description": "Well for one, this makes you a pretty good blacksmith with an emphasis on repair, able to repair most normal weapons, armor and trinkets with the right materials and a bit of time. You're also pretty good at forging and upgrading normal weapons and armor. There is more to this craft than you would first think, as Smiths in this world are capable of several unique acts .In this land, smiths can use special stones to imbue weapons with various types of power, such as Fire or Lightning, during the forging process. Given enough time and practice, they can even forge powerful souls into their handiwork to create unique and often times powerful equipment. While this skill doesn't make you the best in the world at this craft, it gives you a solid foundation with room to improve.",
        "cost": 300,
        "source": "Dark Souls",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 177,
    "fields": {
        "name": "Crafting",
        "description": "There are various things that can only be created through the use of essence and hard work. Shaped equipment, puresteel, certain complicated tools and devices, and certain materials used in enchanting. You can work all of them, producing high quality goods from basic ore and hard work.",
        "cost": 300,
        "source": "Geneforge",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 178,
    "fields": {
        "name": "Moon Orb",
        "description": "The core of the proposed Moon Giant project, it radiates a significant amount of energy, and appears to harvest energy from the light of the moon. Expose to sufficient light -and it'll charge up like a battery, enough to power large automatons for a substantially long amount of time. Well, you could also use it as a night light...but is that a really good way to use it?",
        "cost": 300,
        "source": "Dark Cloud",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 179,
    "fields": {
        "name": "Profession: Enchanting",
        "description": "Imbue all manner of equitable items with magical properties and enhancements using dusts, essences and shards gained by disenchanting (breaking down) magical items that are no longer useful. Enchanters can also make a few low-level wands, as well as oils that can be applied to weapons providing a temporary magical buff. You also have the ability to create “Inscriptions” which act as enchantments for your skills & abilities. Zen Master: At this level you've mastered everything from basics to advanced. Additionally you've expanded your knowledge of the profession beyond the mastery of both basics and advanced stuff to complete understanding of it. At this level you're on even playing field with top 1% of your profession. Should you write down your knowledge it would easily be considered a work of art in that field.",
        "cost": 300,
        "source": "World of Warcraft",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 180,
    "fields": {
        "name": "Talisman Adept",
        "description": "You are very skilled at using talismans. What that means is you can make them have different properties (like light or sound) and with enough time and training you can make with enough time and training you can make truly devastating effects. You are much better at using talismans and can give them properties of what shape they are in. Shaped like a frog? These talismans can bounce towards their intended target.",
        "cost": 300,
        "source": "Inukami",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 181,
    "fields": {
        "name": "Atlantean Power Crystals",
        "description": "Originally discovered by noted psychic Edward Layce, these shining golden gems draw power from the limitless energy from the Sun. When properly harnessed, these crystals can provide enough energy to power an entire city, and if more could be produced, perhaps even a civilization. But be wary, for Atlantis itself once relied on these crystals, and their misuse directly led to that ancient city sinking beneath the waves.",
        "cost": 400,
        "source": "Shivers",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 182,
    "fields": {
        "name": "Material Hybridization",
        "description": "Hybrid materials are the newest and hippest thing to come to Eorzea, since the presence of stolen Garlean magitek technology showed up. Now Alchemists all over Eorzea have been experimenting with this stolen technology, trying to reverse engineer the material and fundamentals behind the creation of such things. A worthy venture, and one from which you've perfected the art of making hybrid materials. Not a matter of making alloys, but making ores and fabrics enchanted with the elements, creating resources fundamentally tied with the Aether. firemetal, watermetal, the hybridization is limited only by the complexity of the element, and the nature of the material. You can't expect to succeed every time, but you'll never succeed if you don't try.",
        "cost": 400,
        "source": "Final Fantasy XIV",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 183,
    "fields": {
        "name": "Universally Upgradeable",
        "description": "-Actually called 'Modular Designs'- It's always easier to make better things from better materials, and your knowledge of far-future engineering is top-notch, meaning that all of the things you make are all that much better for it. Aside from being able to upgrade parts, tools, and weapons further, and make better base parts for tools and weapons, you can apply the bonuses of Infinitely Customizable to things other than tools and weapons, breaking anything down into classes of modular parts and swapping them around to your heart's content. This nearly obviates every part of the process of retro-fitting older creations with newer parts, aside from the actual manual labor and time.",
        "cost": 400,
        "source": "Dead Space",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 184,
    "fields": {
        "name": "Celestial Technology",
        "description": "Though they are not makers, the angels are a force of creation. this perk grants you their knowledge in supernatural technology they use. Holy armor, lances that shoot beams of light and all manner of technology that repels darkness and creatures of evil. You also become more skilled in the use of holy weapons.",
        "cost": 400,
        "source": "Darksiders",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 185,
    "fields": {
        "name": "Solar Harnessing",
        "description": "You can construct articles of technology that harness the power of the sun for their functions or upgrade existing devices to do so. Man-portable weapons should be a breeze, but larger constructions will take more time and effort.",
        "cost": 400,
        "source": "Mysterious Cities of Gold",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 186,
    "fields": {
        "name": "Enchantment?",
        "description": "That's odd, you seem to understand the process of inscribing lyrium runes on items, to add or enhance properties. Without lyrium, enchantments are temporary.",
        "cost": 400,
        "source": "Dragon Age",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 187,
    "fields": {
        "name": "Elven Enchantment",
        "description": "You can enchant objects, if you pour energy into them as they are created. Some of your enchantments are useful in battle, such as swords that never dull and bows that always strike true, but most are simply to ease the life of the wearer, such as cloaks that weigh nothing and aid in hiding and water-flasks that never leak. You may also perform great workings, such as the creation of hidden doorways, given time.",
        "cost": 500,
        "source": "Lord of the Rings",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 188,
    "fields": {
        "name": "Self-Made Shopkeeper",
        "description": "On the quest to stock your shop with truly unique wares, you've learned a skill to fuse items, on a level that no mere shopkeeper could manage by themselves. Anybody can sell a pineapple or a banana, but only you can sell a pinenana! Ok fine, it's actually not that simple. The Fusion spell taught to you works well on items which have the same inherent properties, in the case of two fruits, or two swords, and so forth. Shopkeepers can rejoice that the value of the final product is the additive sum of both ingredients, but only one item can serve as a base, while the other item is consumed. That pineapple that I used as a base for demonstration...well now it can be peeled like a banana. That's handy, right? For any item that this is applied to, it will retain a single trait from the sacrificed item. It's almost as if you were breeding items. On second thought that probably isn’t the best comparison to be making.",
        "cost": 600,
        "source": "Recettear",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 189,
    "fields": {
        "name": "Magitek Mastery",
        "description": "In essence, magitek is simply the use of magical energies as a power and fuel source for technology. Your understanding of that outstrips anyone else, and you can now apply this principle to any technology you own. By altering your devices to use something magical in nature, such as a magicite stone, an enchanted item, or just raw magical energy, you can enhance it in every single way and give it unique properties. A suit of armor would become much harder, lighter, and more agile than before, perhaps even boosting the physical abilities of the wearer in line with the magical power source. From there, the armor could make more esoteric uses of the magic, such as casting spells on its own based around the sort of magic infused into it automatically or at the wearer's prompting. This isn't some measly effect restricted to the mundane or basic, no, magic can infused into any sort of technological device to enhance its functionality and give it a partially magical nature and powers. Even life may be infused with magitek technology like this, not only as cybernetics but directly as well. In this situation, it behaves a bit differently. The magic integrates itself into their body, becoming a natural part of them, allowing them access to that magic system and enhancing them physically, but they must grow into it. They start at a much weaker level, where they have to practice and develop their connection to this magic to realize it fully. There's no upper limit to them beyond what the magic's system is capable of, but it can take time, and you can instead choose to infuse living things with a larger amount of magic to grant them greater magical ability much more quickly. Unfortunately, this can have dangerous side effects, as giving them too much to handle at once can lead to mental instability or even insanity, the severity rapidly scaling upwards the more initial energy put in.",
        "cost": 600,
        "source": "Final Fantasy VI",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 190,
    "fields": {
        "name": "Device Meister",
        "description": "This is the real treasure of the TSAB’s technological capabilities - mixing the use of magic and technology inorder to create Devices that can channel the energy outwards. You have a complete knowledge of how to build and maintain Devices, along with how to program AI for said Devices to use. While you can construct most Devices and similar items presented here, the ability to make Unison Devices isn’t included here - you’ll have to learn that one on your own, and many have tried and failed to do so in the past. You could, with some experimentation, combine different magical systems into Devices together, especially with the help of ‘SimilarPrinciples’ to streamline the process...it will take some trial and error, but you could apply these principles and Devices to other systems if you work at it enough.",
        "cost": 600,
        "source": "Lyrical Nanoha",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 191,
    "fields": {
        "name": "Weapon Synthesis",
        "description": "By now, you've probably come to realize that the weapons in this world are quite peculiar. We're not talking about the Slingshot that speaks to you by the way, the Fairy King had a hand in that one. How does one crystallize a weapon? We're honestly not quite sure, though the magicseems to be consistent with the Atlamillia's properties. The crystals are surely a handy way to store the weapons -but you can also use them to merge into other inanimate objects, passing down a single property of the crystallized weapon as it were.",
        "cost": 600,
        "source": "Dark Cloud",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 192,
    "fields": {
        "name": "Blood Artisan Plus",
        "description": "You have been granted an experienced artisan's knowledge on crafting things out of blood. This is basically an overall improved version of Blood Artisan, allowing you to craft more potent Blood Vials, larger Blood Stones and even Blood Gems. Blood Gems are supernatural gems formed from blood that can be slotted into weapons to give them a variety of special abilities. Some Blood Gems can make an edge sharper, or a tip pointer. Other gems can bathe a weapon in fire, poison or electricity to make them more effective against certain enemies. Some gems can even increase your strength or dexterity while wielding the weapon it's slotted in. Their magical powers can be stacked, to an extent at least. This means you may slot up to three different Blood Gems in the same weapon, though no more. Blood Gems can be slotted and removed with special equipment.",
        "cost": 600,
        "source": "Bloodborne",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 193,
    "fields": {
        "name": "Glyph Magic",
        "description": "You've been trained in the secret art of glyph magic. By writing it down on a surface you can activate the magic. Eventually your skill might grow to the point where you can \"draw\" in the air. There are Battle Glyphs that are utilized in battle, such as attacking or for defensive purposes like invisibility. Utility Glyphs allow you to augment something, such as augmenting a statue with animation, or closing another glyph. Stationary Glyphsare permanent they allow things like locking a door, or a chair to the ground, or perhaps even opening a secret door. These are just some the possibilities that were presented in the games, but perhaps you will find creative uses for all these glyphs. Additionally you’ve been granted the secrets of the transformation glyphs used for “Glyph Enhanced” perk, allowing you to enhance those that serve under you",
        "cost": 600,
        "source": "Thief",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 194,
    "fields": {
        "name": "Maker's Prodigy",
        "description": "The makers decide to teach you the ways of creation and you may choose to become their pupil, they will teach you how to create magical artifacts, imbue places and objects with power and even how to create magical constructs with sentience. Regardless if you spend the time learning from them or not, you will find you learn future skills related to creation, enchantment and forging will come to you as if they were second nature, waiting to be remembered.",
        "cost": 600,
        "source": "Darksiders",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 195,
    "fields": {
        "name": "Infusionist",
        "description": "The ability to infuse items with abilities, Usually Elemental abilities. How good the infused ability depends on the quality and use of the item.",
        "cost": 600,
        "source": "Monster Hunter",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 196,
    "fields": {
        "name": "Lesser Magicks",
        "description": "These are the beginning magicks of the Shianti. ShiantiOrigin who select this ability can choose four skills off of this list after paying the cost of the perk. Non ShiantiOrigin can choose three after paying the cost. Additional skills are 100CP per skill beyond the number allotted by your. Using the Moonstone will enhance the strength and utility of spells from these disciplines. Sorcery–This power allows a wizard to transform his thoughts and desires into magical energy. Focusing your energies will allow you to create magical shields or move objects. Enchantment–Enchantment enables a wizard to charm or beguile other creatures, and create illusions in the minds of others. Elementalism–Minor control over the natural elements of Air, Fire, Earth, and Water. Using this ability requires a trance state. Also, spirits of the Elemental Plane may not understand your request and might answer your call for aid in the manner you did not intend. Alchemy–The ability to create potions and solutions to effect objects and individuals. Prophecy–Through the use of a meditative state, a wizard can foretell the future. The clarity of the foretelling is tied to the wizard’s knowledge of the object or individual in question. Asking about someone or something you know will give more detail than someone or something unknown. Psychomancy–The ability to see and read the past by laying hands on an object. Results may be cryptic, and magic can be used to create intentionally misleading results. Evocation–The ability to contact the spirit realm and speak with the dead. Spirits communed with may be hostile, requiring the wizard to ward himself, and spirits will require the wizard to perform a task in exchange for any aid rendered. Failing to accomplish the agreed upon task may result in the wizard losing his life.",
        "cost": 700,
        "source": "Lone Wolf",
        "domain": 7,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 197,
    "fields": {
        "name": "Transmogrification",
        "description": "Have a set of armor that you like? Yet you like another set of armor’s stats? Well don’t fret! Transmog machine is here! What is it? It looks like a giant washing machine, you can feed any two sets of armor (Head, Chest, Legs, Boots, & Gloves) and choose which one is spit out. The new armor will be best of both worlds. It’ll have the superior stats of the one item, and looks of the other. However the downside is that the other item is destroyed. However both items are in a database so you can always transmog the look. Don’t bother taking it apart and trying to figure out how it works, because there’s no answer. It just works.",
        "cost": 0,
        "source": "World of Warcraft",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 198,
    "fields": {
        "name": "My Fashion Sense is Tingling",
        "description": "You have an impeccable sense of fashion-You can make an appealing outfit out of just about anything. In addition, you will always have an innate knowledge of what is fashionable in the area wherever you go, allowing you to remain on top of your game no matter where you are. In fact, you'll usually be a trendsetter.",
        "cost": 50,
        "source": "TWEWY",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 199,
    "fields": {
        "name": "Deity's Weapon",
        "description": "Naturally, your aura is not your only tool, and neither is it just for show. By imbuing a portion of your aura into a tool, you can turn it into a weapon capable of eating through physical and magical barriers alike. Naturally, as you’re infusing a portion of your mystic nature into the tool, with time it will grow to possess magical qualities as well. With a sufficient amount of time passing, you could very well find yourself bearing a mystic weapon, one that has naturally absorbed enough mystic force to rival the greatest of magical weapons. With enough time, all that energy would be enough to make it a weapon of yore. Just don’t expect it to happen anytime soon.",
        "cost": 100,
        "source": "Warrior's Orochi",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 200,
    "fields": {
        "name": "Stylish Mechanic",
        "description": "In addition to knowing how to repair and create mechanical devices you also have quite a knack at making anything you work on look good. Any timeyou fix something it'll end up clean and pleasant to look at, and you can easily come up with humorous or awe-inspiring designs for vehicles and devices.",
        "cost": 100,
        "source": "Gurren Lagann",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 201,
    "fields": {
        "name": "Clothing Skinner",
        "description": "this magic device allows you to take the look of one set of clothing and apply it to another set of clothing. Want to have full plate armor that looks like a tuxedo? This will allow you to do that.",
        "cost": 100,
        "source": "Aion",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 202,
    "fields": {
        "name": "Tailor Made",
        "description": "You are a brilliant designer and can ensure objects you create are always looking fantastic, aesthetically pleasing and the like. Making something look good no longer takes any time or effort­ you can focus entirely on function, and whatever you make will look outstanding",
        "cost": 100,
        "source": "Career Model",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 203,
    "fields": {
        "name": "Aesthetics",
        "description": "Others may be able to do what you do, but you? You make it look GOOD. Really, REALLY good. All buildings you construct now have a distinctive architectural flair that marks them as yours and yours alone. Even a simple wooden shack you build will have people nodding matter-of-factly and recognizing the design like a nation's flag, if they've had experience with you before. In addition, purely aesthetic construction - landscaped bays, parks, covered walkways, promenades - are not only cheaper to build, but require little to no upkeep.",
        "cost": 100,
        "source": "Anno 2070",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 204,
    "fields": {
        "name": "Minor blessings",
        "description": "For one reason or another you've got a god who cares slightly about you and has seen fit to grant you some minor boon within their domains. Choose one god from any pantheon and gain a minor boon from them. The god will care slightly about you but unless you go on to further distinguish yourself it will be more of a minor interest in your affairs than someone they feel the need to help (Effectively think a diminished version of one ability a demigod might have, think minor ones are stuff along the lines of breathing water, lucid dreaming, or appropriate vague extra senses, useful but nothing especially major). This can be taken multiple times.",
        "cost": 100,
        "source": "Percy Jackson",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 205,
    "fields": {
        "name": "Bling of War",
        "description": "It's one thing to have a weapon or vehicle of mass destruction, capable of rending an entire ground force or a squadron to shame. It's another to make it look so damn good your enemies would not dare get near it if they had a lick of sense. By purchasing this perk, you can design your equipment to look much more stylish and carry a 'theme' you prefer. This can range from the clothes you wear, to the weapons you wield, to even the vehicles you pilot into battle. It's all about style.",
        "cost": 100,
        "source": "Macross",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 206,
    "fields": {
        "name": "Decadence",
        "description": "You have the skills to sacrifice neither form nor function when you design, create, or arrange things, which is especially important in a society whose upper crust values opulence the way this society does --after all, the Emperor's throne is carved out of a single massive gemstone. Whether it's interior decorating, crafting a knife or sword, building furniture or a vehicle... you can make it appeal perfectly to the most crass or the upper crust. You can also figure out the optimal decor for any purpose or environment, which includes the best places to hide discreet surveillance devices.",
        "cost": 100,
        "source": "Dune",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 207,
    "fields": {
        "name": "Aesthetics and Flair",
        "description": "A gun isn't quite a gun until it LOOKS good, you know? It's supposed to be classy, make you look amazing just for having it. Likewise, that sword could use a bit of badass styling to it. When you create your weapons, you can make them look DAMNED good even on an off day. Expect any weapon creator to envy you, and those who die by your weapons to count themselves lucky as they perish to such beautiful art.",
        "cost": 100,
        "source": "Bayonetta",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 208,
    "fields": {
        "name": "Technical Expertise",
        "description": "You're pretty damn impressive when it comes to all sorts of technical applications. With this, you can better modify your own weaponry, armor and augmentations. Or just be creative and accomplish tasks like rigging an elevator to catapult it's occupants into the ceiling, turning them into paste. Fun",
        "cost": 100,
        "source": "Iji",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 209,
    "fields": {
        "name": "Accessory Machine",
        "description": "It is one thing to go out into the world and do a Knight's duty, but it is another to look the part. This machine is special, allowing you to create cosmetic pieces or effects and bind them to your equipment to improve their appearance, though this requires resources. Nothing really comes free, after all. Armor pieces, auras, or even cosmetic wings... go ahead. Express yourself. Let your creativity flow.",
        "cost": 200,
        "source": "Spiral Knights",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 210,
    "fields": {
        "name": "Mythril Coating",
        "description": "In many realms throughout the rift, mythril has always been an element of reputable worth. With the powers of the rift however, this mythril coating has been charged somewhat. Able to be applied onto both weapons and armor, items coated with this will be constantly charged with magical energy. As a consequence of this, the affected item allows one to sustain energy draining forms for twice as long, and improves their power slightly.",
        "cost": 200,
        "source": "Dissidia",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 211,
    "fields": {
        "name": "Fixer Upper",
        "description": "When they put you through an apprenticeship, the first thing they did was to tell you to take apart a train. Then put it back together again. Then they repeated the process, removing parts bit by bit, and yet every time you still managed to put the train back together. Eventually you've come to realize that you can repair things -all while removing any extraneous parts to ensure that the efficiency of a machine is optimized .Machines that you’ve tinkered with...don’t seem to need as much to work as others might.",
        "cost": 200,
        "source": "Dark Cloud 2",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 212,
    "fields": {
        "name": "Innovator",
        "description": "You'll never make a name for yourself if you can't innovate -and sometimes, innovation requires you to take risks and make mistakes, even ones which might be catastrophic. It takes effort to gain experience, and it takes courage to put in effort -but you've also got a bit of beginner's luck whenever you start trying to produce something new. You're far more likely to succeed -and consequently far less likely to fail if you go in completely blind, but more importantly than that, you're not likely to come up with a completely useless product in the end.",
        "cost": 200,
        "source": "Final Fantasy XIV",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 213,
    "fields": {
        "name": "Beauty in the Arts",
        "description": "The Greeks and their gods have an eye for the aesthetics of their surroundings. Whether it is the statues around them, or the floors they walk upon, or the things they carry and wield, it is better if it is appealing. Your ability to design any of your crafts has increased with this knowledge, able to appeal to form without sacrificing function. Regardless of what you create, it's going to look good enough that the gods might take notice... might. Whether this is a good thing, or a bad thing is for you to decide.",
        "cost": 200,
        "source": "God of War",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 214,
    "fields": {
        "name": "Material Synthesis Science",
        "description": "You know a few things about getting your own materials, but you also have a bit of know-how about how the people here get such quality materials. Normally, you know how to forge, quench and mold materials into more high quality specimens, but you have a specialization in Zero-Gravity Material Synthesis as well-in microgravity conditions, you can create much more effective materials thanks to the limitations of gravity being removed.",
        "cost": 200,
        "source": "Gundam: After Colony",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 215,
    "fields": {
        "name": "Do One Thing At A Time",
        "description": "When you focus yourself on doing a single task, your skill and efficiency doubles. Material requirements are unaffected, but time taken is halved and quality is doubled.",
        "cost": 300,
        "source": "Dinotopia",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 216,
    "fields": {
        "name": "Engineering Iteration",
        "description": "The highly analytical mind of a prototype can always see a way to improve something. Even with existing materials and techniques, there is always a slightly better way for you to manufacture a certain part or lubricate a joint. The improvements you make to your devices are noticeable and potentially endless, but you quickly find yourself at the mercy of diminishing returns. You can expect the first 50% worth of improvements to be reasonably attainable and up to 75% expensive, but beyond that it becomes prohibitively expensive.",
        "cost": 400,
        "source": "Sunrider",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 217,
    "fields": {
        "name": "Secret of Steel",
        "description": "An illustrated guide created by the greatest master of weapons the world has ever known. It keenly details the techniques, methods and set­up required to create weapons using traditional Japanese techniques. This text goes beyond that however, and if the directions are followed perfectly it can be used to forge weapons, armor, and tools that are far better than anything that could possibly be made even with the most advanced metallurgic technology. Objects created—while still composed of steel—will be significantly stronger than steel and can withstand blows from a Martial Arts Master. Blades made using these techniques will be preternaturally sharp, able to cut through stone, steel and perhaps even more with proper strength and training. Such bladed weapons will almost never lose their edge and require virtually no maintenance. Armor made using these techniques is nearly indestructible and will never rust or corrode. Normal tools will work with such efficiency that even primitive tools can accomplish feats of scale equivalent to highly advanced modern technology. For example, a scythe made with these techniques could harvest an entire field in the same amount of time as a combine harvester or a simple hoe could do the work of a tractor­towed plough.",
        "cost": 400,
        "source": "History's Strongest Disciple: Kenichi",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 218,
    "fields": {
        "name": "Lathe of Heaven",
        "description": ": We're always going to need weapons, so the way I see it, you might as well get good at making them. Now? You'll be able to give old man Melchior a run for his money. Swords, guns, armor, even sunglasses - if it's worn or wielded, you can make it a masterpiece. You'll also learn how to make use of any material, bringing out its best qualities and minimizing its weaknesses. You could make bone sharper than steel, gold sturdier than titanium, and take a legendary material nobody's ever seen before, and figure out how to forge it, what to alloy it with, and how to craft that alloy into an impossibly sharp sword or some amazing shades.",
        "cost": 400,
        "source": "Chrono Trigger",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 219,
    "fields": {
        "name": "Form and Function",
        "description": "A while back, you overheard something your customers had said -about cloth and leather being insufficient to protect them out in the wilderness of Eorzea. You have to admit that they do have a bit of a point. Cloth and leather might be far more comfortable than a suit of plate armor, but functionally they protect substantially less. But maybe if you could use a different material, things might be different? The principle of this weave is the same as when you made inner linings. But whereas inner linings allowed you to split open layers in order to weave enchantments and magic inside, now you have folded layer upon layer with inlaid crystals to attain a weave that can withstand blows just as well as a suit of plate might. The amount of crystals you need for the process is substantial -but the magic is ultimately necessary, so that you don't leave a single imperfection which may ruin the final product, and also so that it doesn't end up looking bulky and cumbersome. Objects that you craft with the same principle exhibit durability several times stronger than what you would have expected from an equivalent of similar weight.",
        "cost": 400,
        "source": "Final Fantasy XIV",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 220,
    "fields": {
        "name": "Armsfusion Crafter",
        "description": "this magical machine will merge any two weapons or pieces of armor placed into it into a single weapon or piece of armor. The two items need not be weapons or armor, but the must be similar. The machine is roughly the size of a coffin. When used the items merge so that it keeps the superior properties of each without stacking old properties. (For example sword A has +5 str. Sword B has +3 str as well as deals lightning damage. The resulting sword would have +5 str and lightning dmg.)",
        "cost": 400,
        "source": "Aion",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 221,
    "fields": {
        "name": "Ambrosial Artificer",
        "description": "So many moving parts, so many pieces to the puzzle. It's so... needless. The other tech teams are complete morons. That's why you've learned how to figure out the optimization of your complex machines like Veritechs. What parts you don't need, you find a way to do away with. What parts you DO need, you can use the now-extra space to improve and bolster their performance. Some will call you mad. But the only madness that will come from your work is the rage of your enemies and rivals.",
        "cost": 400,
        "source": "Macross",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 222,
    "fields": {
        "name": "Mechanical Master",
        "description": "You are a master armsmith and roboticist. You can build and maintain standard weapons and shields with ease, and if you put some effort into understanding it you could probably make E-Tech your bitch. Further, you can make temporary Digistruct items, though they tend to explode after brief use. If you find the right components, you might even be able to modify good stuff into truly unique weapons; some might call them Legendary. Though for some reason they always look kind of pearly.",
        "cost": 400,
        "source": "Borderlands",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 223,
    "fields": {
        "name": "Expert Smithing",
        "description": "It’s not just about creating the sharpest blade anymore. Improved items now have “affixes” on them based on how many times they’ve been improved. Each level will be tougher than the next to improve and require more energy/mana/souls, but the Blacksmith’s smithing ability now has no cap",
        "cost": 400,
        "source": "Ragnarok Online",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 224,
    "fields": {
        "name": "Incredibly Craftsmanship",
        "description": "While the method of creating Teigu is long lost you are able to create things almost at their level, with some research and a couple other skilled people you might even be able to recreate the lost arts that created the Teigu long ago. You also have all the skills to repair Teigu or other incredible items from near destruction.",
        "cost": 600,
        "source": "Akame ga Kill",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 225,
    "fields": {
        "name": "Chosen of Death",
        "description": "Great Yama, Death-god, has seen you clearly and bade you enter the Vasty Hall of Death, to serve as his partner in creation. Not merely revealing his secrets of science -you are his equal in the arts. Your creativity is that which may forge ten unique treasures each day, or mass produce legends. Design of all forms of weapons, armors, vehicles, and utilities comes to you with blinding light and strength of inspiration. With this position comes the virtual guarantee of rebirth in your next life, as a Demigodof the forge.",
        "cost": 600,
        "source": "Lord of Light",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 226,
    "fields": {
        "name": "Soulcraft",
        "description": "With the souls of strong opponents, you may forge great weapons and armor out of them. Of course you can craft with lesser souls but the product won’t be that great. The weaker souls can only be used to upgrade things instead. You instinctively understand how to use anything you made.",
        "cost": 600,
        "source": "Demons' Souls",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 227,
    "fields": {
        "name": "Master Craftsman",
        "description": "Thanks to being taught by faeries anything you make by hand is a great deal better than anything regular human can make. Armor is nearly indestructible and lighter than it should be, blades are sharper, blunt weapons have more force behind them, bows and crossbows can shoot farther and are easier to pull back. Even mundane items like baskets work better, though you can't give items mystical powers without being a wizard or something.",
        "cost": 600,
        "source": "King Arthur",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 228,
    "fields": {
        "name": "Remodelling",
        "description": "You can remodel living or inanimate things through training, surgery, drugs or other scientific methods. Through this you can improve their efficiency or bring out their true potential. It can bring out powers that are dormant within you, but not create new ones.",
        "cost": 600,
        "source": "Medaka Box",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 229,
    "fields": {
        "name": "'Daedalus' student",
        "description": "It is one thing to work on forging mere sword and shield, but it is another to create truly marvelous wonders... for a mortal. You could make marvelous wings out of bird feathers and beeswax, capable of granting flight to anyone. Or maybe you wish to create an everchanging Labyrinth, that shifts and alters itself depending on how it moves. Regardless, your architect and forging skills have taken a dramatic increase, to the point where the things you create just may have properties and quality they normally shouldn't have, albeit directed towards the purpose of your creations. Through your works, your will be known... but take care that the gods do not take offense with your work.",
        "cost": 600,
        "source": "God of War",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 230,
    "fields": {
        "name": "Craftsman of the Gods",
        "description": "Things you make yourself from base components gain properties far beyond what they should. Belts that increase strength several times over or a spear that never misses are well within your skill, and you will only get better.",
        "cost": 600,
        "source": "Viking Saga",
        "domain": 8,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 231,
    "fields": {
        "name": "Nanite sciences",
        "description": "You possess in depth knowledge of nanite technologies. With sufficient equipment and resources you could produce and control nanite machines, possibly even recreate the nanite event or maybe figure out how to reverse its effects. But that would take a long time of additional study of nanites out in the world, still you might be one of the few who could attempt this endeavor. You possess no knowledge of the meta-nanites, and understanding how they work is beyond your grasp.",
        "cost": 100,
        "source": "Generator Rex",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 232,
    "fields": {
        "name": "They're Like Legoes, Right?",
        "description": "There's robust engineering, and then there's modularity. Pick one. Except for you - you seem to have the gift of designing methods that allow for seamless mixing and matching of modular technology that lack none of the parts incompatibility and fragility you'd except from such a design paradigm. While this seems focused on Kerbin technology in specific, a little work should have you applying such a paradigm to all sorts of technologies...",
        "cost": 200,
        "source": "Kerbal Space Program",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 233,
    "fields": {
        "name": "Nanotech Wizard",
        "description": "You acquire a basic understanding of the nanotech of this universe. Use it to fix yourself up when you get hurt, or use it on others. If integrated with weapons or armor, it gives them the capacity to upgrade over time and to potentially change their abilities.",
        "cost": 200,
        "source": "Ratchet & Clank",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 234,
    "fields": {
        "name": "Weapons Recombination Template",
        "description": "The shady dealer (Actually it seems like everything he's offered so far is shady) just shrugs when you pick this up. Apparently, it binds two weapons together, and allows you to shapeshift the weapon between either form. You're not quite sure how it works, but he demonstrates it to you by showing you how a bow can shift into a sword. You can't help but notice that it also turned into a Moogle afterwards...but apparently yours won't do that. Unless you throw a Moogle into the mix. Wait...does that mean...",
        "cost": 200,
        "source": "Final Fantasy XIII-2",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 235,
    "fields": {
        "name": "Tinkerer",
        "description": "You're a whiz at maintaining, modifying and making things. Everything from Sniper Scythes to Toaster Ovens, as long as you made it yourself or had the blueprints on hand. Unlock the secret of Variable Weapon Crafting.",
        "cost": 300,
        "source": "RWBY",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 236,
    "fields": {
        "name": "Gadget Master",
        "description": "You’ve been trained by Major Boothroyd at the skills of his job. You’re excellent at creating and maintaining gadgets of all types. You can miniaturize nearly anything, and hide things in forms that... really shouldn’t work. You can even make lasers! You’re also good at coming up with ideas for unusual methods of assassination; beheading umbrellas, flamethrower bagpipes, and the like.",
        "cost": 300,
        "source": "007",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 237,
    "fields": {
        "name": "Hybridization Theory",
        "description": "So one day you had a bit of spare time after your daily Zoid admiration hour. After taking a close look at your favorite Gojulas and your favorite Mad Thunder, you decided that if the Gojulas could wield the Mad Thunder's Magnesser Drills like an arm weapon, you could probably reenact that scene from the show you watched two days back on theprofessor's hi-def television. Those mechanics can slap on parts and scavenge however they like. You can literally merge two machines together into one, with twice the processing power as before. Mind you, Zoids typically won't respond well to suddenly sharing a body with another core and another mind, but you'll have ethical uses for this...right? For most mundane machinery, you don't need any power source besides your own, but be careful that should you make your machine too big, the internal power supply might not be enough to feed it.",
        "cost": 400,
        "source": "Zoids: Legacy",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 238,
    "fields": {
        "name": "Sohon",
        "description": "Sohon is the semi-spiritual technique used by the Indowy to build all the best Galactic technology (like, for example, ACS). Sohon adepts are incredibly rare; of all 18 trillion Indowy, only a few hundred have the potential to become a user of Sohon at all. A Sohon adept mentally controls nanites in a special tank to “grow” the technology under their direction, allowing for chemical structures and molecular formations that... really shouldn’t happen. While you’ll never be a true adept (never ranking, for example, among human Mentats), you can at least utilize the basics, allowing you to repair Galactic tech and, with a lot of time and effort, maybe make a little of your own.",
        "cost": 400,
        "source": "Legacy of the Aldenata",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 239,
    "fields": {
        "name": "Miniaturization/Efficiency",
        "description": "You can miniaturize anything down to levels that any sane man would consider impossible. A fusion reactor the size of a watch battery would be the absolute minimum of what you are capable of, and you'd be able to make it far smaller than that. Your power also makes you a master of technological efficiency, anything you make needing barely any energy to run compared to what it should and continue to do so for a very long time. These specialties also make you a master of nanotechnology and similar pursuits. Of course you aren't barred from building something big like a giant robot, just that it'll be impossibly efficient and crammed full of more weapons and subsystems then should be possible",
        "cost": 400,
        "source": "Worm",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 240,
    "fields": {
        "name": "Master Builder",
        "description": "You’ve been programmed with mastery of Cybertronian science allowing you to jury-rig any tech you see, as well allowing you to quickly build even the most complex Cybertronian tech within a reasonable time period. Smaller devices are almost instant, larger devices take some time and more components. However with enough material you can build a temporary space bridge. Despite your mastery of Cybertonian science, creation of a Spark and therefore intelligent life, organic or inorganic is beyond you.",
        "cost": 400,
        "source": "Transformers",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 241,
    "fields": {
        "name": "Prototyper",
        "description": "You’re more than capable of inventing new and novel systems that integrate existing technologies in startlingly effective ways. Any fool can make a laser or a missile bigger; what you do is combine different technologies in new and inventive ways - they thought Tenkian was a genius? Well he's got nothing on you. Whoever though putting a shear-field on a missile was going to work? Here, you'll find inspiration for combining the Polity’s technologies in new ways – hardfields, antimatter devices, artificial gravity, AI subminds, Under-space tech, all the neat stuff – even Pradortech. The technology of the Jain, Csorians and Atheter are still beyond you, however. After this jump, your inspiration works to combine different technologies from completely differentorigins into new devices, and removes the restriction on Jain/Csorian/Atheter tech.",
        "cost": 600,
        "source": "Polity",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 242,
    "fields": {
        "name": "Nano-Technician",
        "description": "Is it me or does “nanomachines” not sound like a word anymore? You now have a considerable talent in the field of nanotech. With time and study, you could recreate the Nanoforge, with dedication you could even improve on it. Keep in mind nanotech in this setting is exceptionally hard to work with, but can do anything from fixing a bridge, to disintegrating a starship, to enhancing human abilities.",
        "cost": 600,
        "source": "Red Faction",
        "domain": 9,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 243,
    "fields": {
        "name": "Rationing",
        "description": "When you don’t have much, it’s important to be careful with what you’ve got. You’re very good at saving supplies, ensuring that anything you find of use stays found and that it doesn’t get wasted by accident. You’ll get every last drop of fuel from a can, and never drop some plastic tubing just because you can’t think of a use at the moment.",
        "cost": 100,
        "source": "Mad Max",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 244,
    "fields": {
        "name": "Acquester",
        "description": "In times of crisis and desperation, resources become too precious to use on anything other than necessities. The spiral Order has had to save all their supplies to repair their ship, so you've had to make do on the field. you know how to look for your own resources, remaining self-sufficient in the field through using scavanged items as supplies for anything ranging from simple maintenance to complex construction. Power Cores, Blighted Bones, or even Goo Drops can be used as spare parts or more. With what you've learnt, these days you don't just survive, you thrive. Whether it's machines that power the Constructs or the way that Wolver's fur burns, you've learned to figure out what separates useful resources from useless refuse. The world keeps spinning, knight. Keep up or die.",
        "cost": 100,
        "source": "Spiral Knights",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 245,
    "fields": {
        "name": "Composition Analysis",
        "description": "\"Before you get to work, you need to know what it is you're dealing with!\" -that was the first lesson you were taught when you started this discipline. Certainly, your mentor was right. Without knowing what you're working with, you're simply courting with catastrophe. With a bit of help from the Aether tools you have, you can discern the properties of any material you're working with -enough to know if there's an occupational hazard involved with handling them. But with sufficient practice and a discerning eye, you can figure out what any item is made up of.",
        "cost": 100,
        "source": "Final Fantasy XIV",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 246,
    "fields": {
        "name": "Element Analysis",
        "description": "With a little elbow grease, you can easily identify the elemental composition of ANY material and with the right resources, break it down to its base elements for further use.",
        "cost": 100,
        "source": "Bomberman 64: The Second Attack",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 247,
    "fields": {
        "name": "Super Scientific Solution",
        "description": "This perk grants two features that in universe depend on your setting, out of universe both work unless you desire otherwise. Slice of Life: Science solves everything, even the little household problems. You can create supertech improvements to common tools and appliances, up to and including automobiles or similar works of engineering. Create dishwashers that can clean dishes in an instant, self heating plumbing or forcefield window panes that act as air conditioners. Space­Opera: Well established methodologies and an instinctive grasp of same allow you to draw conclusions or produce results incredibly fast. You halve the time it takes to gather data, compose research on some subject, or devise a test to prove/disprove something­ handy for when you have to figure out an enemy fortresses’ one weakness…",
        "cost": 100,
        "source": "Tenchi Muyo",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 248,
    "fields": {
        "name": "Repair Savvy",
        "description": "Your skills in mechanics are top notch. Your weapons, armor, and personal equipment are all easy to repair, and maintenance of all of them takes mere minutes instead of hours.",
        "cost": 100,
        "source": "Outlaw Star",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 249,
    "fields": {
        "name": "The Honed Edge",
        "description": "With just a bit of time and polish you can restore any blade to its true sharpness, as if it were just crafted. Rust and tarnish to away with ease as well. Your tools and weapons are always in the best shape. SOME effort does need to be put into this care of course",
        "cost": 100,
        "source": "Pocky & Rocky",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 250,
    "fields": {
        "name": "Cold Fires",
        "description": "The hotter the fire, the easier the metal is to form -but too hot, and the metal will simply melt away. That's always been a conundrum which you had to solve. The mages however, have a different solution for your problem. By imbuing fire with Aether, you can reach the conditions necessary for forging at far lower temperatures than normal. Similarly, the intensity of any fire spell you cast is significantly increased",
        "cost": 200,
        "source": "Final Fantasy XIV",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 251,
    "fields": {
        "name": "Harmeless Extraction",
        "description": "With hempen yarn and animal skins in shorter supply since the catastrophe, you and other craftsman have had to adapt your practices in order to keep the orders met. Practices to minimize the amount of animals killed, to make the most out of that which you have on hand are all crucial nowadays as resources grow scarcer. While the animals still aren't too comfortable with it, with this magic you can weave together a copy of their skin or wool, while only taking a small portion of what they have. It doesn't really feel right, but at least the animal is still alive! It’ll take time, but what you’ve taken will slowly grow back.",
        "cost": 200,
        "source": "Final Fantasy XIV",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 252,
    "fields": {
        "name": "Reliable Invention",
        "description": "Anything you construct is only broken when used improperly or purposefully targeted with attacks. The items you create do not malfunction and are completely resistant to damage caused by regular usage.",
        "cost": 200,
        "source": "Kim Possible",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 253,
    "fields": {
        "name": "Reuseable Resources",
        "description": "Recycling requires effort. There is always a loss - in terms of energy, in terms of time, in terms of effort, in terms of materials. Your faction's knowledge of materials science has minimized this loss to the utmost; When destroying buildings, recovering crashed vehicles, or decommissioning equipment, you always recover the same amount of material put into it's construction, ripe for being re-applied to other tasks.",
        "cost": 200,
        "source": "Anno 2070",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 254,
    "fields": {
        "name": "Scrapper",
        "description": "You have the capability to dismantle and repurpose objects for your own creations; even ones that you might not fully understand. So long as it’s not hopelessly beyond your understanding, indestructible, or ridiculously big, you’re capable of taking most things and reducing them to their base components, salvaging any working parts with only a few days of work at the worst.",
        "cost": 300,
        "source": "Fallout 4",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 255,
    "fields": {
        "name": "Scrapyard Skills",
        "description": ": Where others see junk, you see treasure just waiting to be utilized. You can make far more use out of scrap metal and tossed out electronics, repurposing them for many different tasks. That washer machine might have the parts needed to help spin an engine turbine, or that piston tube might be JUST the right size to refashion into a grappling hook launcher... it's all in how you use it and how you repurpose things.",
        "cost": 300,
        "source": "Swat Kats",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 256,
    "fields": {
        "name": "Panzerkampf",
        "description": "When it comes to building war machines, yours are top-notch! A gun made by your own hand will never jam, and a tank built by you will never bog down in mud or take damage from an IED. If they want to destroy what you've built, they'd best bring their A-game.",
        "cost": 300,
        "source": "Sabaton",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 257,
    "fields": {
        "name": "Crimson Weapons",
        "description": "When you look at the various giblets you carve off of the monsters of the labyrinth, you find many of their parts are suitable for crafting weapons and armor. In fact, they're usually outright superior to regular materials. With time and effort, you could make just about anything you pry off of a monster into something useful. You could turn a lion's claws into a wicked-sharp sword, or a pair of horns into an excellent bow.",
        "cost": 300,
        "source": "Etrian Odyssey",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 258,
    "fields": {
        "name": "Salvager",
        "description": "When the ore runs out and the company tells the miners to leave, that's where you really shine. It's cheaper to leave gear to rot in an abandoned site than it is to get it into orbit, across the galaxy and set up again so there's always something good just waiting for a new owner. With this skill you are an expert at jury rigging tech, taking it apart, stripping out the usable parts and putting them into something else. With time and effort you can puzzle out the workings of most technologies and how to integrate them into your own gear. Every day or industrial equipment might take a few moments, but bleeding edge gear will take years, even decades to understand.",
        "cost": 300,
        "source": "Babylon 5",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 259,
    "fields": {
        "name": "Built to Last",
        "description": "Whatever you personally build, be it handheld or architectural, becomes nigh-impervious to weather, rust and time. If it gets lost or buried, you can 'feel' it out too!",
        "cost": 300,
        "source": "Assassin's Creed",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 260,
    "fields": {
        "name": "Robust Engineering",
        "description": "Ten thousand years of stagnation in technology is a very long time... and now you know how to apply the lessons of those millennia to the construction of anything you have. Mass production does not exist any longer and even relatively common items are made as if masterwork quality, because aside from obvious cheap items, they have been built to last longer than the person using them. Expect anything you construct by hand to be able to last centuries, as long as you take a little extra time while you make it. With the amount of time you're going to be around... you may need that sort of quality.",
        "cost": 300,
        "source": "Dune",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 261,
    "fields": {
        "name": "More With Less",
        "description": "Through careful construction, you can remove unnecessary components and get maximum efficiency into your products. What this means, is that you can create the same quality item while using less resources. Items with which you have a limited supply, such as alien materials, can be stretched farther.",
        "cost": 300,
        "source": "XCOM",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 262,
    "fields": {
        "name": "Waste Not",
        "description": "use half as many resources as usual with a chance of not needing rare materials at all.",
        "cost": 300,
        "source": "Monster Hunter",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 263,
    "fields": {
        "name": "Efficiency",
        "description": "Waste not, want not! Not with this, anyway – whether building machines or making quick moves in combat, you'll never unintentionally use more energy, materials, or flourish than you need to.",
        "cost": 400,
        "source": "Lego: Ninjango",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 264,
    "fields": {
        "name": "Lack of Materials",
        "description": "Times are tough in this land. Forces beyond knowing, monsters that roam the lands, and gods who are as petty as they are powerful. With chaos such as this, there are times you may not be able to get everything of what you need. But you've learned to make do. You can get the most out of your materials, using two bars of metal where you might need four, or three hides when you needed six. Of course, if you DO have all the materials required you can use them to make your creations more effective in quality and capability as well. So maybe it doesn't hurt to put the extra mile in.",
        "cost": 400,
        "source": "God of War",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 265,
    "fields": {
        "name": "Armsthrift",
        "description": "Your weapons just don’t seem to break and you know how to care for them well. Even immensely fragile things are unlikely to break in your care. Guns won’t jam and swords never lose their edge",
        "cost": 400,
        "source": "Fire Emblem: Awakened",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 266,
    "fields": {
        "name": "Scavenger",
        "description": "Thanks to those filthy communists trying to take everything (hypocrisy, anyone?), you've had to learn to make do on things. You can get more 'bang for your buck' on materials and fuels, making machines last longer than they normally should. Furthermore, with crafting and building you know JUST how to use them to reduce your resource requirements. How's THAT for 'not needing unnecessarily' you goobers?!",
        "cost": 400,
        "source": "Squirrel and Hedgehog",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 267,
    "fields": {
        "name": "Mauler",
        "description": "You have the skills of a junkyard hound, able to make even the most heavily damaged tech work again. Even machines too battle-damaged for recovery 20 years ago can be effective under your wrench. Repurposing tech and equipment is your forte; you can turn a pneumatic screwdriver into a reasonable cannon, and heaven help your enemies if you get anywhere near mining equipment, as a power-armored mutant is quickly appearing in their future. There was even one time where you made a toaster into a reasonable facsimile of a flamethrower.....",
        "cost": 400,
        "source": "Command and Conquer: Tiberium Wars",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 268,
    "fields": {
        "name": "Gadgeteer",
        "description": "Not only do you have the knowledge and resources to produce all of WOOHP and the Center's gadgets quickly and efficiently, but you'll never run out of ideas for new gadgets, and you'll be able to incorporate any other technologies you know seamlessly.",
        "cost": 600,
        "source": "Totally Spies",
        "domain": 10,
        "prereq_perks": [],
        "prereq_addons": []
    }
},
{
    "model": "celestial_forge.perk",
    "pk": 269,
    "fields": {
        "name": "Tech Wizard",
        "description": 